import os
import logging
from dotenv import load_dotenv

# Налаштування логування
logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)
logger = logging.getLogger(__name__)

# Завантаження змінних середовища
load_dotenv()

# Telegram конфігурація
TELEGRAM_BOT_TOKEN = os.getenv('TELEGRAM_BOT_TOKEN')

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")

MANAGER_ERROR="Нажаль сталась помилка при надсиланні повідомлення, спробуйте зв'язатись з одним з наших менеджерів по посиланню @confetti_manager або @confettimanager"

#Привітання з користувачем
Hello_World = "🎉 Вас вітає Bot CONFETTI - найкращий помічник в створенні незабутніх свят та подій!\n\nОберіть місто, де ви хочете організувати свято:"

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']

# Типи подій
EVENT_TYPES = {
    '🎂 День народження': 'День народження',
    '📅 Афіша подій': 'Афіша подій',
    '🎓 Випускний': 'Випускний',
    '👨‍👩‍👧‍👦 Сімейне свято': 'Сімейне свято',
    '🎯 Інше': 'Інше'
}
# Список типів подій для клавіатури
EVENT_TYPES_LIST = list(EVENT_TYPES.keys())

# Ціни/Кнопки на семейні свят
FAMALY_TRIP = {
    "Київ":{
        "Ведучий 1 година": 4000,
        "Ді-джей 1 година": 4000,
        "Бебісітер 1 година": 2000
    },
    "Кривий Ріг":{
        "Ведучий 1 година": 1500,
        "Ді-джей 1 година": 2000,
        "Бебісітер 1 година": 1800
    }
}

FAMILY_INFO = (
    "Ми можемо бути з вами на будь-якому сімейному святі та зробимо все, щоб дорослі відпочивали та спілкувались, а діти проводили час весело та під наглядом.\n\n"
    "Свята, на які нас запрошують:\n"
    "- Святкування першого року життя 🎂\n"
    "- Хрестини ✝️\n"
    "- Весілля 💏\n"
    "- Ювілей та інше 🎉"
)

FAMILY_INFO_INFO2 = (
    "Щоб дізнатися більш детальну інформацію або зробити замовлення - звертайтесь до менеджера 📲"
)



# Інформація текстова в Афіша подій
CITY_CHANNELS = {
    'Київ': 'Очікуйте оновлень.',
    'Кривий Ріг': 'MomUp організовує\nSPORT Day для мам і дітей🤩\n\nЯскравий день на свіжому повітрі, заряд енергією та гарним настроєм у компанії таких же чудових мам💜\n\n👶🧒А про дітей подбають наші професійні аніматори, поки ви насолоджуєтесь часом та активностями!\n\n🗓️Коли: 10.05\n⏰Час: 13:00–15:30\n📍Де: парк Саксаганський (біля ПК Мистецький)\n\n🔎На вас чекає:\n• Майстер-клас Зумби від Малої Ксенії (отметка)@\n• Весела программа та активні ігри від спортивних ведучих\n• Захопливі спортивні челенджі для мам і дітей\n• Легкий пікнік на природі\n• Аніматори та розваги для малечі\n🎁Нагородження кожного учасника!\n\n💟Вартість:\n450₴ — дитячий квиток\n350₴ — дорослий квиток\n🎫 Реєструйтесь зараз — кількість місць обмежена!\n📲 +380 96 830 83 63\n📩DM'
}

FOTO_AFISHA = {
    'Київ': 'матеріали/images/Афіша/',
    'Кривий Ріг': 'матеріали/images/Афіша/1.MP4'
}

# Загальна інформація для розділу "Інше"
GENERAL_INFO = {
    'Київ': (
        "🌟 CONFETTI у Києві - це:\n\n"
        "🎭 Професійні аніматори\n"
        "🎨 Яскраві шоу-програми\n"
        "🔑 Організація свят під ключ\n"
        "🎁 Особливий підхід до кожного клієнта\n\n"
        "Наші послуги доступні по всьому Києву та області!"
    ),
    'Кривий Ріг': (
        "🌟 CONFETTI у Кривому Розі - це:\n\n"
        "🎭 Креативні аніматори\n"
        "🎨 Унікальні програми\n"
        "🔑 Організація свят під ключ\n"
        "🎁 Індивідуальний підхід\n\n"
        "Працюємо по всьому місту та передмістю!"
    )
}

# Контактна інформація менеджера
MANAGER_INFO = {
    'Київ': {
        'phone': '+380976036768',
        'telegram': '@confetti_manager',
        'name': 'Поліна'
    },
    'Кривий Ріг': {
        'phone': '+380968308363',
        'telegram': '@confettimanager',
        'name': 'Поліна'
    }
}

# Повідомлення для контактів менеджера
MANAGER_CONTACT_MESSAGES = {
    'Київ': (
        "👋 Вас вітає менеджер CONFETTI-bot у Києві!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n" 
        "📞 Зателефонувати: {phone}\n"
        "👤 Менеджер: {name}\n"
        "📱 Написати: {telegram}\n\n"
        "Працюємо щодня з 9:00 до 20:00"
    ),
    'Кривий Ріг': (
        "🎈 CONFETTI-bot Кривий Ріг вітає вас!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n"  
        "👤 Менеджер: {name}\n"
        "📞 Зателефонувати: {phone}\n"
        "📱 Написати: @confetti_manager\n\n"
        "👤 Менеджер: Андрій\n"
        "📞 Зателефонувати: +380973185979\n"
        "📱 Написати: {telegram}\n\n"
        "Чекаємо на ваше звернення з 9:00 до 20:00"
    )
}

# Отримання та конвертація ID менеджера
try:
    MANAGER_CHAT_ID_KIEV = int(os.getenv('MANAGER_CHAT_ID_KIEV'))
    MANAGER_CHAT_ID_KR = int(os.getenv('MANAGER_CHAT_ID_KR'))
    logger.info(f"ID менеджера Київ успішно завантажено: {MANAGER_CHAT_ID_KIEV}")
    logger.info(f"ID менеджера Кривий Ріг успішно завантажено: {MANAGER_CHAT_ID_KR}")
except (TypeError, ValueError) as e:
    logger.error(f"Помилка при завантаженні ID менеджера: {str(e)}")
    MANAGER_CHAT_ID_KIEV = None
    MANAGER_CHAT_ID_KR = None

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")
if not MANAGER_CHAT_ID_KIEV:
    logger.error("Не знайдено ID менеджера Київ в змінних середовища")
if not MANAGER_CHAT_ID_KR:
    logger.error("Не знайдено ID менеджера Кривий Ріг в змінних середовища")

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']





# Шляхи до PDF файлів з місцями проведення
LOCATION_PDF_FILES = {
    'Київ': 'матеріали/місця проведення/locations_київ.pdf',
    'Кривий Ріг': 'матеріали/місця проведення/locations_кривий_ріг.pdf'
}

# Локації для різних типів подій
LOCATIONS = {
    '🎂 День народження': [
        '🏠 Вдома',
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ],
    '🎓 Випускний': [
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ]
}

# Інформація про локації
LOCATION_INFO = {
    'Київ': {
        '🏠 Вдома': 'Організуємо незабутнє свято у вас вдома!',
        '🍽 Ресторан/Кафе': 'Організуємо яскраве свято у будь-якому кафе або ресторані, яке ви оберете!',
        '🏫 Садочок/Школа': 'Організуємо яскраве та веселе свято в навчальному закладі!',
        '🏰 Заміський комплекс': 'Організуємо чудовий відпочинок за містом!',
        '📍 Інше': 'Допоможемо з вибором будь-якого місця'
    },
    'Кривий Ріг': {
        '🏠 Вдома': 'Створимо атмосферу свята у вашій оселі!',
        '🍽 Ресторан/Кафе': 'Організуємо яскраве свято у будь-якому кафе або ресторані, яке ви оберете!',
        '🏫 Садочок/Школа': 'Організуємо яскраве та веселе свято в навчальному закладі!',
        '🏰 Заміський комплекс': 'Організуємо чудовий відпочинок за містом!',
        '📍 Інше': 'Допоможемо з вибором оптимального місця'
    }
}

# Тематики свят
THEMES = [
    '🏰 Казкові герої',
    '🎮 Game Party',
    '🦸‍♂️ Супергерої',
    '🎉 Вечірка',
    '📞 Зв\'язатись з менеджером'
]

# Опис тематик
THEME_INFO = {
    '🏰 Казкові герої': 'Улюблені персонажі казок оживуть на вашому святі та відправляться разом з іменинником у світ магії, чарів та яскравих подій! ',
    
    '🎮 Game Party': 'Вечірка в стилі улюблених відеоігор! '
                    'Minecraft, Roblox, Among Us та інші популярні ігри '
                    'стануть частиною вашого свята.',
    
    '🦸‍♂️ Супергерої': 'Захоплююча зустріч з супергероями! '
                      'Людина-павук, Бетмен, Чудо-жінка та інші герої завітають на ваше свято та відправляться у справжні пригоди разом з іменинником та його друзями! ',
    
    '🎉 Вечірка': 'Яскрава вечірка з сучасними ведучими, популярними трендами, танцями та розвагами! Створимо драйвову атмосферу для неперевершеного святкування!'
} 

# --- Тематичні кнопки по містам ---
THEME_BTN = {
    'Київ': {
        '🏰 Казкові герої': [
            'Сонік та Емі',
            'Цифровий цирк',
            'Барбі та Кен',
            'Лісова казка',
            'Уенсдей',
            'Єдиноріжки',
            'Крижане серце',
            'Paw Patrol',
            'Міккі та Мінні',
            'Леді Баг та Супер Кіт',
            'Аліса та Капелюшник',
            'Гаррі Поттер та Герміона',
            'Ляльки Лол',
            'Принцеса Аврора та Принц Філіпп',
            'Малефісента',
            'Літл Поні',
            'Феї Winx',
            'Герої в масках',
            'Лалафанфан',
            'Білий ведмедик',
            'Зоотрополіс',
            'Тролі',
            'Три коти',
            'Тачки',
            'Моана та Мауї',
            'Пеппа та Джордж',
            'Сofія Прекрасна',
            'Котяча вечірка',
            'Рапунцель',
            'Посіпаки',
            'Маша і Ведмідь',
            'Фіксики',
            'Монстри на канікулах',
            'Лего Ніндзяго',
            'Русалонька та Коник',
        ],
        '🎮 Game Party': [
            'Roblox',
            'Brawl stars',
            'Minecraft',
            'Among us',
        ],
        '🦸‍♂️ Супергерої': [
            'Залізна Людина та Диво Жінка',
            'Людина Павук та Жінка Кішка',
            'Супермен та Супервумен',
            'Трансформери',
            'Бетмен',
            'Капітан Америка та Залізна Людина',
            'Черепашки Ніндзя',
        ],
        '🎉 Вечірка': [
            'Спортивна',
            'Морська',
            'Sweet Party',
            'K-Pop',   
            'Tik-tok party', 
            'Safari party', 
            'Секретна лабораторія', 
            'Перший мільйон', 
            'Pop-it party', 
            'Smile party', 
            'Космічна', 
            'Французька', 
            'Футбольна', 
            'Голівуд',
            'Гра в кальмара',
        ]
    },
    # Додайте інші міста за аналогією
    'Кривий Ріг': {
        '🏰 Казкові герої': [
            'Сонік та Емі',
            'Барбі та Кен',
            'Лісова казка',
            'Уенсдей',
            'Єдиноріжки',
            'Крижане серце',
            'Paw Patrol',
            'Міккі та Мінні',
            'Леді Баг та Супер Кіт',
            'Аліса та Капелюшник',
            'Гаррі Поттер та Герміона',
            'Ляльки Лол',
            'Принцеса Аврора та Принц Філіпп',
            'Малефісента',
            'Літл Поні',
            'Феї Winx',
            'Герої в масках',
            'Лалафанфан',
            'Білий ведмедик',
            'Зоотрополіс',
            'Тролі',
            'Три коти',
            'Тачки',
            'Моана та Мауї',
            'Пеппа та Джордж',
            'Сofія Прекрасна',
            'Котяча вечірка',
            'Рапунцель',
            'Посіпаки',
            'Маша і Ведмідь',
            'Фіксики',
            'Монстри на канікулах',
            'Лего Ніндзяго',
            'Русалонька та Коник',
        ],
        '🎮 Game Party': [
            'Roblox',
            'Brawl stars',
            'Minecraft',
            'Among us',
        ],
        '🦸‍♂️ Супергерої': [
            'Залізна Людина та Диво Жінка',
            'Людина Павук та Жінка Кішка',
            'Супермен та Супервумен',
            'Трансформери',
            'Бетмен',
            'Капітан Америка та Залізна Людина',
            'Черепашки Ніндзя',
        ],
        '🎉 Вечірка': [
            'Спортивна',
            'Морська',
            'Sweet Party',
            'K-Pop',   
            'Tik-tok party', 
            'Safari party', 
            'Секретна лабораторія', 
            'Перший мільйон', 
            'Pop-it party', 
            'Smile party', 
            'Космічна', 
            'Французька', 
            'Футбольна', 
            'Голівуд',
            'Гра в кальмара',
        ]
    }
} 

THEME_PHOTOS = {
    'Київ': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КИЇВ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КИЇВ/казкові_герої/Русалочка та коник.jpg',

            'Сонік та Емі': 'матеріали/images/КИЇВ/казкові_герої/Сонік.PNG',
            'Барбі та Кен': 'матеріали/images/КИЇВ/казкові_герої/Барбі і Кен.PNG',
            'Лісова казка': 'матеріали/images/КИЇВ/казкові_герої/Мавка і Лукаш.PNG',
            'Уенсдей': 'матеріали/images/КИЇВ/казкові_герої/венсдей.PNG',
            'Єдиноріжки': 'матеріали/images/КИЇВ/казкові_герої/Єдиноріжки.PNG',
            'Крижане серце': 'матеріали/images/КИЇВ/казкові_герої/Крижане серце.PNG',
            'Paw Patrol': 'матеріали/images/КИЇВ/казкові_герої/Paw Patrol.jpg',
            'Міккі та Мінні': 'матеріали/images/КИЇВ/казкові_герої/Міккі та Мінні.PNG',
            'Леді Баг та Супер Кіт': 'матеріали/images/КИЇВ/казкові_герої/Леді Баг.PNG',
            'Аліса та Капелюшник': 'матеріали/images/КИЇВ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КИЇВ/казкові_герої/Гаррі Поттер та Герміона.PNG',
            'Ляльки Лол': 'матеріали/images/КИЇВ/казкові_герої/Лол.PNG',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КИЇВ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КИЇВ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КИЇВ/казкові_герої/Літл Поні.PNG',
            'Феї Winx': 'матеріали/images/КИЇВ/казкові_герої/Феї.jpg',
            'Герої в масках': 'матеріали/images/КИЇВ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КИЇВ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КИЇВ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КИЇВ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КИЇВ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КИЇВ/казкові_герої/Три коти.PNG',
            'Тачки': 'матеріали/images/КИЇВ/казкові_герої/Тачки.PNG',
            'Моана та Мауї': 'матеріали/images/КИЇВ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КИЇВ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КИЇВ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КИЇВ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КИЇВ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КИЇВ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КИЇВ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КИЇВ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КИЇВ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КИЇВ/казкові_герої/Лего Ніндзяго.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КИЇВ/game_party/Roblox.PNG',
            'Brawl stars': 'матеріали/images/КИЇВ/game_party/Brawl stars.PNG',
            'Minecraft': 'матеріали/images/КИЇВ/game_party/Minecraft.PNG',
            'Among us': 'матеріали/images/КИЇВ/game_party/Among us.PNG',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КИЇВ/супергерої/Супергерої.PNG',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КИЇВ/супергерої/Людина Павук та Жінка Кішка.jpg',
            'Супермен та Супервумен': 'матеріали/images/КИЇВ/супергерої/Супермен та Супервумен.jpg',
            'Трансформери': 'матеріали/images/КИЇВ/супергерої/Трансформери.PNG',
            'Бетмен': 'матеріали/images/КИЇВ/супергерої/Бетмен.jpg',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КИЇВ/супергерої/Капітан Америка та Залізна Людина.jpg',
            'Черепашки Ніндзя': 'матеріали/images/КИЇВ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КИЇВ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КИЇВ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КИЇВ/вечірка/Sweet Party.jpg',
            'K-Pop': 'матеріали/images/КИЇВ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КИЇВ/вечірка/Tik-tok party.PNG',
            'Safari party': 'матеріали/images/КИЇВ/вечірка/Safari party.PNG',
            'Секретна лабораторія': 'матеріали/images/КИЇВ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КИЇВ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КИЇВ/вечірка/Pop-it party.PNG',
            'Smile party': 'матеріали/images/КИЇВ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КИЇВ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КИЇВ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КИЇВ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КИЇВ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КИЇВ/вечірка/Гра в кальмара.jpg',
        }
    },
    'Кривий Ріг': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
            'Сонік та Емі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сонік та Емі.PNG',
            'Барбі та Кен': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Барбі та Кен.PNG',
            'Лісова казка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лісова казка.PNG',
            'Уенсдей': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/венсдей.PNG',
            'Єдиноріжки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Єдиноріжки.PNG',
            'Крижане серце': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Крижане серце.PNG',
            'Paw Patrol': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Paw Patrol.PNG',
            'Міккі та Мінні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Міккі та Мінні.PNG',
            'Леді Баг та Супер Кіт': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Леді Баг та Супер Кіт.PNG',
            'Аліса та Капелюшник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Гаррі Поттер та Герміона.PNG',
            'Ляльки Лол': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Ляльки Лол.PNG',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Літл Поні.PNG',
            'Феї Winx': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Феї Winx.jpg',
            'Герої в масках': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Три коти.PNG',
            'Тачки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тачки.PNG',
            'Моана та Мауї': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лего Ніндзяго.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КРИВИЙ РІГ/game_party/Roblox.PNG',
            'Brawl stars': 'матеріали/images/КРИВИЙ РІГ/game_party/Brawl stars.PNG',
            'Minecraft': 'матеріали/images/КРИВИЙ РІГ/game_party/Minecraft.PNG',
            'Among us': 'матеріали/images/КРИВИЙ РІГ/game_party/Among us.PNG',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супергерої.PNG',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Людина Павук та Жінка Кішка.jpg',
            'Супермен та Супервумен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супермен та Супервумен.jpg',
            'Трансформери': 'матеріали/images/КРИВИЙ РІГ/супергерої/Трансформери.PNG',
            'Бетмен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Бетмен.jpg',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КРИВИЙ РІГ/супергерої/Капітан Америка та Залізна Людина.jpg',
            'Черепашки Ніндзя': 'матеріали/images/КРИВИЙ РІГ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КРИВИЙ РІГ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Sweet Party.PNG',
            'K-Pop': 'матеріали/images/КРИВИЙ РІГ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Tik-tok party.PNG',
            'Safari party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Safari party.PNG',
            'Секретна лабораторія': 'матеріали/images/КРИВИЙ РІГ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КРИВИЙ РІГ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Pop-it party.PNG',
            'Smile party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КРИВИЙ РІГ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КРИВИЙ РІГ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КРИВИЙ РІГ/вечірка/Гра в кальмара.jpg',
        }
    }
}

# Формати свята
EVENT_FORMATS = {
    '⏰ Погодинно': 'Погодинна оплата',
    '📦 Пакетні пропозиції': 'Пакетні пропозиції',
    '🎯 Квести': 'Квести'
} 

# Конфігурація погодинних цін
HOURLY_PRICES = {
    'Київ': {
        '🎂 День народження': {
            'Експрес привітання (1 аніматор)/20 хвилин': 2000,
            'Експрес привітання (2 аніматори)/20 хвилин': 3000,
            '1 аніматор 1 година': 3000,
            '2 аніматори 1 година': 3500,
            '2 аніматори (ростові) 1 година': 4000,
            '3 аніматори 1 година': 5000
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 3500
        },
        '🎂 День народження (турбаза)': {
            '2 аніматори 1 година': 3500
        },
        '🎓 Випускний (турбаза)': {
            '2 аніматори 1 година': 3500
        }
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            '2 аніматори 1 година': 1800,
            '2 аніматори 2 години': 1800*2,
            '2 аніматори 3 години': 1800*3,
            '2 аніматори 4 години': 1800*4
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 2200
        },
        '🎂 День народження (турбаза)': {
            '2 аніматори 1 година': 1800
        },
        '🎓 Випускний (турбаза)': {
            '2 аніматори 1 година': 2200
        }
    }
}  

PAKET_PRICES = {
    'Київ': {
        '🎂 День народження': {
            'Лайтовий 1.5 годин': 5000,
            'Magic 1.5 годин': 5500,
            'Frosty 1.5 годин': 6000,
            'Основний 2 години': 6000,
            'Magic 2 години': 7000,
            'Frosty 2 години': 8000,
            'Комплексний 3 години': 8500,
            'Топовий 3 години': 10000,
            'Квестовий 3 години': 12000,
            'Fun 2 години (підлітковий)': 7000,
            'Quest 2 години (підлітковий)': 9000,
            'Pop-dance 3 години (підлітковий)': 10000
        },
        '🎓 Випускний': {
            'Розважальний (1.5 год)': 7500,
            'Вражаючий (2 год)': 8700,
            'Кольоровий (2 год)': 9700,
            'Драйвовий (2.5 год)': 11000  
        }   
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            'Святковий 1.5 години': 2900,
            'Magic 1.5 годин': 2900,
            'Frosty 1.5 годин': 3500,
            'Quest 2 години': 4000,
            'Особливий 2 години': 3900,
            'Творчий 3 години': 5500,
            'Fun 2 години (підлітковий)': 4000,
            'Quest 2 години (підлітковий)': 4500,
            'Pop-dance 3 години (підлітковий)': 5500
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 3400,
            'Color 1.5 годин': 4000,
            'WoW 1.5 годин': 4500  
        }     
    }
}

# Посилання на фото для пакетів
PAKET_PHOTOS = {
    'Київ': {
    '🎂 День народження': {
        'Лайтовий 1.5 годин': 'матеріали/images/КИЇВ/Пакети/Лайтовий.PNG',
        'Magic 1.5 годин': 'матеріали/images/КИЇВ/Пакети/Magic.PNG',
        'Frosty 1.5 годин': 'матеріали/images/КИЇВ/Пакети/Frosty.PNG',
        'Основний 2 години': 'матеріали/images/КИЇВ/Пакети/Основний.PNG',
        'Magic 2 години': 'матеріали/images/КИЇВ/Пакети/Magic2.PNG',
        'Квестовий 3 години': 'матеріали/images/КИЇВ/Пакети/квестовий.PNG',
        'Frosty 2 години': 'матеріали/images/КИЇВ/Пакети/frosty2.PNG',
        'Комплексний 3 години': 'матеріали/images/КИЇВ/Пакети/комплексний.PNG',
        'Топовий 3 години': 'матеріали/images/КИЇВ/Пакети/топовий.PNG',
        
        'Fun 2 години (підлітковий)': 'матеріали/images/КИЇВ/Пакети/fun.PNG',
        'Pop-dance 3 години (підлітковий)': 'матеріали/images/КИЇВ/Пакети/pop.PNG',
        'Quest 2 години (підлітковий)': 'матеріали/images/КИЇВ/Пакети/quest.PNG'
    },
    '🎓 Випускний': {
        'Розважальний (1.5 год)': 'матеріали/images/КИЇВ/Пакети/Розважальний.PNG',
        'Вражаючий (2 год)': 'матеріали/images/КИЇВ/Пакети/вражаючий.PNG',
        'Кольоровий (2 год)': 'матеріали/images/КИЇВ/Пакети/кольоровий.PNG',
        'Драйвовий (2.5 год)': 'матеріали/images/КИЇВ/Пакети/драйвовий.PNG'  
    }
},
'Кривий Ріг': {
    '🎂 День народження': {
        'Святковий 1.5 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Святковий.PNG',
        'Особливий 2 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Особливий.PNG',
        'Творчий 3 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Творчий.PNG',
        'Magic 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Magic.PNG',
        'Frosty 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Frosty.PNG',
        'Quest 2 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Quest.PNG',
        'Quest 2 години (підлітковий)': 'матеріали/images/КРИВИЙ РІГ/Пакети/questPidlitki.PNG',
        'Fun 2 години (підлітковий)': 'матеріали/images/КРИВИЙ РІГ/Пакети/fun.PNG',
        'Pop-dance 3 години (підлітковий)': 'матеріали/images/КРИВИЙ РІГ/Пакети/Pop.PNG'
    },
    '🎓 Випускний': {
        'Study 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Study.jpg',
        'Color 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Color.jpg',
        'WoW 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/WOW.jpg'
    }
}
}

PAKET_OPIS = {
    'Київ': {
    '🎂 День народження': {
        'Лайтовий 1.5 годин': '+',
        'Magic 1.5 годин': '+',
        'Frosty 1.5 годин': '+',
        'Основний 2 години': '+',
        'Magic 2 години': '+',
        'Квестовий 3 години': '+',
        'Frosty 2 години': '+',
        'Комплексний 3 години': '+',
        'Топовий 3 години': '+',
        
        'Fun 2 години (підлітковий)': 'Опис 1',
        'Pop-dance 3 години (підлітковий)': 'Опис 2',
        'Quest 2 години (підлітковий)': 'Опис 3'
    },
    '🎓 Випускний': {
        'Розважальний (1.5 год)': '+',
        'Вражаючий (2 год)': '+',
        'Кольоровий (2 год)': '+',
        'Драйвовий (2.5 год)': '+'  
    }
},
'Кривий Ріг': {
    '🎂 День народження': {
        'Святковий 1.5 години': 'Опис 17',
        'Особливий 2 години': 'Опис 18',
        'Творчий 3 години': 'Опис 19',
        'Magic 1.5 годин': 'Опис 20',
        'Frosty 1.5 годин': 'Опис 21',
        'Quest 2 години': 'Опис 22',
        'Quest 2 години (підлітковий)': 'Опис 23',
        'Fun 2 години (підлітковий)': 'Опис 24',
        'Pop-dance 3 години (підлітковий)': 'Опис 25'
    },
    '🎓 Випускний': {
        'Study 1.5 годин': '+',
        'Color 1.5 годин': '+',
        'WoW 1.5 годин': '+'
    }
}
}

QWEST = {
    'Київ': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'НАВКОЛО СВІТУ (6+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ДЖУНГЛІ (10+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 8500,
            '2 години': 9500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 8500,
            '2 години': 9500
        },
        'КВЕСТ ПАТІ (10+ років)': {
            '1,5 години': 10000,
            '2 години': 13000
        }
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'НАВКОЛО СВІТУ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЖУНГЛІ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДІДЖИТАЛ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'МОРСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        }
    }
}

#фото для квестів
QWEST_PHOTOS = {
    'Київ': {
        'САФАРІ (5-7 років)': 'матеріали/images/КИЇВ/квести/САФАРІ.JPG',
        'НАВКОЛО СВІТУ (6+ років)': 'матеріали/images/КИЇВ/квести/НАВКОЛО СВІТУ.JPG',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'матеріали/images/КИЇВ/квести/СУПЕРГЕРОЙСЬКИЙ.JPEG',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'матеріали/images/КИЇВ/квести/ЩЕНЯЧИЙ ПАТРУЛЬ.JPG',
        'ДЕТЕКТИВНИЙ (8+ років)': 'матеріали/images/КИЇВ/квести/ДЕТЕКТИВНИЙ.JPG',
        'PLAYDAY (7+ років)': 'матеріали/images/КИЇВ/квести/PLAYDAY.PNG',
        'GIRLS TIME (5+ років)': 'матеріали/images/КИЇВ/квести/GIRLS TIME.JPG',
        'ДЖУНГЛІ (10+ років)': 'матеріали/images/КИЇВ/квести/САФАРІ.JPG',
        'В СВІТІ ДІСНЕЙ (5+ років)': 'матеріали/images/КИЇВ/квести/В СВІТІ ДІСНЕЙ.jpeg',
        'ВЕНСДЕЙ (7+ років)': 'матеріали/images/КИЇВ/квести/ВЕНСДЕЙ.JPG',
        'ГАРРІ ПОТТЕР (7+ років)': 'матеріали/images/КИЇВ/квести/ГАРРІ ПОТТЕР.JPEG',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': 'матеріали/images/КИЇВ/квести/КРИЖАНЕ СЕРЦЕ.jpg',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'матеріали/images/КИЇВ/квести/СЕКРЕТНА ЛАБОРАТОРІЯ.JPEG',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': 'матеріали/images/КИЇВ/квести/ЕЛІКСИР ЩАСТЯ.jpg',
        'КВЕСТ ПАТІ (10+ років)': 'матеріали/images/КИЇВ/квести/КВЕСТ ПАТІ.JPG'
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/САФАРІ.JPG',
        'НАВКОЛО СВІТУ (8+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/НАВКОЛО СВІТУ.JPG',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/СУПЕРГЕРОЙСЬКИЙ.JPEG',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/ЩЕНЯЧИЙ ПАТРУЛЬ.JPG',
        'ДЕТЕКТИВНИЙ (8+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ДЕТЕКТИВНИЙ.JPG',
        'PLAYDAY (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/PLAYDAY.PNG',
        'GIRLS TIME (5+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/GIRLS TIME.JPG',
        'ДЖУНГЛІ (10+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/САФАРІ.JPG',
        'ДІДЖИТАЛ (10+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ДІДЖИТАЛ.JPG',
        'ВЕНСДЕЙ (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ВЕНСДЕЙ.JPG',
        'МОРСЬКИЙ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/МОРСЬКИЙ.jpg',
        'В СВІТІ ДІСНЕЙ (5+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/В СВІТІ ДІСНЕЙ.jpeg',
        'ГАРРІ ПОТТЕР (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ГАРРІ ПОТТЕР.JPEG',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/КРИЖАНЕ СЕРЦЕ.jpg',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/СЕКРЕТНА ЛАБОРАТОРІЯ.JPEG',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ЕЛІКСИР ЩАСТЯ.JPG'
    }
}

QWEST_OPIS = {
    'Київ': {
        'САФАРІ (5-7 років)': 'Опис 1',
        'НАВКОЛО СВІТУ (6+ років)': 'Опис 2',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'Опис 3',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'Опис 4',
        'ДЕТЕКТИВНИЙ (8+ років)': 'Опис 5',
        'PLAYDAY (7+ років)': 'Опис 6',
        'GIRLS TIME (5+ років)': 'Опис 7',
        'ДЖУНГЛІ (10+ років)': 'Опис 8',
        'В СВІТІ ДІСНЕЙ (5+ років)': 'Опис 9',
        'ВЕНСДЕЙ (7+ років)': 'Опис 10',
        'ГАРРІ ПОТТЕР (7+ років)': 'Опис 11',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': 'Опис 12',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'Опис 13',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': 'Опис 14',
        'КВЕСТ ПАТІ (10+ років)': 'Опис 15'
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': 'Опис 16',
        'НАВКОЛО СВІТУ (8+ років)': 'Опис 17',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'Опис 18',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'Опис 19',
        'ДЕТЕКТИВНИЙ (8+ років)': 'Опис 20',
        'PLAYDAY (7+ років)': 'Опис 21',
        'GIRLS TIME (5+ років)': 'Опис 22',
        'ДЖУНГЛІ (10+ років)': 'Опис 23',
        'ДІДЖИТАЛ (10+ років)': 'Опис 24',
        'ВЕНСДЕЙ (7+ років)': 'Опис 25',
        'МОРСЬКИЙ (5-7 років)': 'Опис 26',
        'В СВІТІ ДІСНЕЙ (5+ років)': 'Опис 27',
        'ГАРРІ ПОТТЕР (7+ років)': 'Опис 28',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': 'Опис 29',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'Опис 30',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': 'Опис 31'
    }
}

# Фотографії для додаткових послуг
ADDITIONAL_SERVICES_PHOTOS = {
    'Київ': {
        'ШОУ': {
            'ПАПЕРОВЕ ШОУ': 'матеріали/images/КИЇВ/шоу/ПАПЕРОВЕ ШОУ.jpg',
            'ШОУ ПРУЖИНИ': 'матеріали/images/КИЇВ/шоу/ШОУ ПРУЖИНИ.JPEG',
            'ТЕСЛА ШОУ': 'матеріали/images/КИЇВ/шоу/ТЕСЛА ШОУ.JPG',
            'НАУКОВИЙ МІКС': 'матеріали/images/КИЇВ/шоу/НАУКОВИЙ МІКС.JPEG',
            'CRAZY CRIO': 'матеріали/images/КИЇВ/шоу/CRAZY CRIO.jpg',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/КИЇВ/шоу/ШОУ МИЛЬНИХ БУЛЬБАШОК.JPEG',
            'ШОУ ФОКУСІВ': 'матеріали/images/КИЇВ/шоу/ШОУ ФОКУСІВ.JPEG',
            'ПІННА ВЕЧІРКА': 'матеріали/images/КИЇВ/шоу/ПІННА ВЕЧІРКА.PNG'
        },
        'МАЙСТЕР-КЛАС': {
            'Створення амулетів': 'матеріали/images/КИЇВ/майстер_класи/1.png',
            'Слайми': 'матеріали/images/КИЇВ/майстер_класи/Слайми.PNG',
            'Термомозаїка': 'матеріали/images/КИЇВ/майстер_класи/1.png',
            'Бомбочки для ванни': 'матеріали/images/КИЇВ/майстер_класи/1.png',
            'Шиммер коктейлі': 'матеріали/images/КИЇВ/майстер_класи/Шиммер коктейлі.PNG',
            'Шоколадний попіт': 'матеріали/images/КИЇВ/майстер_класи/Шоколадний попіт.PNG',
            'Свічки': 'матеріали/images/КИЇВ/майстер_класи/Свічки.PNG',
            'Мило': 'матеріали/images/КИЇВ/майстер_класи/Мило.PNG',
            'Пряники': 'матеріали/images/КИЇВ/майстер_класи/Пряники.PNG',
            'Солодкі букети': 'матеріали/images/КИЇВ/майстер_класи/1.png',
            'Морозиво': 'матеріали/images/КИЇВ/майстер_класи/Морозиво.PNG',
            'Солодка вата': 'матеріали/images/КИЇВ/майстер_класи/Солодка вата.PNG',
            'МАЙСТЕР': 'матеріали/images/КИЇВ/майстер_класи/1.png',
            'Льодяники з ізомальту': 'матеріали/images/КИЇВ/майстер_класи/1.png',
            'BEARBRICK': 'матеріали/images/КИЇВ/майстер_класи/BEARBRICK.PNG',
            'Твістінг': 'матеріали/images/КИЇВ/майстер_класи/1.png'
        },
        "ПІН'ЯТИ": {
            'Стандартна пін\'ята - від:': 'матеріали/images/КИЇВ/піньяти/пінята2.JPEG',
            'Фігурна пін\'ята - від:': 'матеріали/images/КИЇВ/піньяти/пінята3.JPEG'
        },
        'ГЕНЕРАТОР': {
            '🫧 Генератор мильних бульбашок': 'матеріали/images/КИЇВ/генератор/Бульбашки.jpg',
            '💦 Аквагрим (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/АКВАГРИМ.JPG',
            '🐻 Білий ведмедик (+дорога)': 'матеріали/images/КИЇВ/генератор/Білий ведмедик.jpg',
            '🕺 Дзеркальні люди (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Дзеркальні люди.JPEG',
            '🐦 Птахи (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Птахи.JPEG',
            '💃 Глітер тату (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/ГЛІТЕР ТАТУ.JPG',
            '🎂 Торти 1 кг': 'матеріали/images/КИЇВ/генератор/Торт.JPG',
            '💡 ДИСКО СВІТЛО': 'матеріали/images/КИЇВ/генератор/ДИСКО ШАР.JPG'
        }
    },
    'Кривий Ріг': {
        'ШОУ': {
            'ШДМ шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/ШДМ шоу.JPEG',
            'ШОУ ПРУЖИНИ': 'матеріали/images/КРИВИЙ РІГ/шоу/ШОУ ПРУЖИНИ.JPEG',
            'Паперове шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/ПАПЕРОВЕ ШОУ.jpg',
            'ШОУ ФОКУСІВ': 'матеріали/images/КРИВИЙ РІГ/шоу/ШОУ ФОКУСІВ.JPEG',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/КРИВИЙ РІГ/шоу/ШОУ МИЛЬНИХ БУЛЬБАШОК.JPEG',
            'Треш шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/ТРЕШ ШОУ.JPEG',
            'Хімічне шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/CRAZY CRIO.jpg',
            'ТЕСЛА ШОУ': 'матеріали/images/КРИВИЙ РІГ/шоу/ТЕСЛА ШОУ.JPG',
            'Фабрика сюрпризів': 'матеріали/images/КРИВИЙ РІГ/шоу/Фабрика сюрпризів.JPEG',
            'Пінна вечірка': 'матеріали/images/КРИВИЙ РІГ/шоу/Пінна вечірка.PNG'
        },
        'МАЙСТЕР-КЛАС': {
            'Створення амулетів': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'Слайми': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Слайми.PNG',
            'Термомозаїка': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'Бомбочки для ванни': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'Шиммер коктейлі': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Шиммер коктейлі.PNG',
            'Шоколадний попіт': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Шоколадний попіт.PNG',
            'Свічки': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Свічки.PNG',
            'Мило': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Мило.PNG',
            'Пряники': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Пряники.PNG',
            'Солодкі букети': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'Морозиво': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Морозиво.PNG',
            'Солодка вата': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Солодка вата.PNG',
            'МАЙСТЕР': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'Льодяники з ізомальту': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'BEARBRICK': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/BEARBRICK.PNG',
            'Твістінг': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png'
        },
        "ПІН'ЯТИ": {
            'Стандартна пін\'ята - від: ': 'матеріали/images/КРИВИЙ РІГ/піньяти/пінята2.JPEG',
            'Велика пін\'ята - від: ': 'матеріали/images/КРИВИЙ РІГ/піньяти/пінята.JPEG'
        },

        'ГЕНЕРАТОР': {
            '🫧 Генератор мильних бульбашок': 'матеріали/images/КИЇВ/генератор/Бульбашки.jpg',
            '💦 Аквагрим (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/АКВАГРИМ.JPG',
            '🐻 Білий ведмедик (+дорога)': 'матеріали/images/КИЇВ/генератор/Білий ведмедик.jpg',
            '🕺 Дзеркальні люди (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Дзеркальні люди.JPEG',
            '🐦 Птахи (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Птахи.JPEG',
            '💃 Глітер тату (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/ГЛІТЕР ТАТУ.JPG',
            '🎂 Торти 1 кг': 'матеріали/images/КИЇВ/генератор/Торт.JPG',
            '💡 ДИСКО СВІТЛО': 'матеріали/images/КИЇВ/генератор/ДИСКО ШАР.JPG'
        }
    }
}

# Додаткові послуги з підменю
ADDITIONAL_SERVICES_WITH_SUBMENU = {
    'Київ': {
        '🎭 Шоу': {
            'ПАПЕРОВЕ ШОУ': 2500,
            'ШОУ ПРУЖИНИ': 4000,
            'ТЕСЛА ШОУ': 4500,
            'НАУКОВИЙ МІКС': 4500,
            'CRAZY CRIO': 4500,
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 6000,
            'ШОУ ФОКУСІВ': 6000,
            'ПІННА ВЕЧІРКА': 7000
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': 250,
            'Слайми - 1 дитина': 250,
            'Термомозаїка - 1 дитина': 250,
            'Бомбочки для ванни - 1 дитина': 250,
            'Шиммер коктейлі - 1 дитина': 250,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 300,
            'Мило - 1 дитина': 350,
            'Пряники - 1 дитина': 350,
            'Солодкі букети - 1 дитина': 350,
            'Морозиво до 10 дітей': 3500,
            'Морозиво до 20 дітей': 4500,
            'Солодка вата до 10 дітей': 3500,
            'Солодка вата до 20 дітей': 4000
        },
        '🎨 Декор': {
            'Базовий декор від': 7000,
            'Люкс декор від': 10000
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від:': 1500,
            'Фігурна пін\'ята - від:': 1800
        },
        '🎁 Експрес привітання':{
            '1 аніматор 20 хвилин': 2000,
            '2 аніматори 20 хвилин': 3000
        }
    },
    'Кривий Ріг': {
        '🎭 Шоу': {
            'ШДМ шоу': 2500,
            'Шоу пружини': 2500,
            'Паперове шоу': 2500,
            'Шоу фокусів': 2700,
            'Шоу мильних бульбашок': 2900,
            'Треш шоу': 3200,
            'Хімічне шоу': 3200,
            'Тесла шоу': 3500,
            'Фабрика сюрпризів': 3500,
            'Пінна вечірка': 4500
        },
        '🎨 Майстер-клас': {
            'МАЙСТЕР': 800,
            'Створення амулетів - 1 дитина': 150,
            'Солодкі букети - 1 дитина': 200,
            'Слайми - 1 дитина': 200,
            'Термомозаїка - 1 дитина': 200,
            'Бомбочки для ванни - 1 дитина': 200,
            'Шиммер коктейлі - 1 дитина': 200,
            'Льодяники з ізомальту - 1 дитина': 200,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 250,
            'Мило - 1 дитина': 250,
            'Пряники - 1 дитина': 300,
            'BEARBRICK - 1 дитина': 500,
            'Твістінг до 10 дітей': 500,
            'Твістінг до 20 дітей': 800,
            'Морозиво до 10 дітей': 2000,
            'Морозиво до 20 дітей': 3000,
            'Солодка вата до 10 дітей': 2000,
            'Солодка вата до 20 дітей': 3000
        },
        '🎨 Декор': {
            'Базовий декор від': 4000,
            'Люкс декор від': 8000
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від: ': 900,
            'Велика пін\'ята - від: ': 1100
        },
        '🎁 Експрес привітання':{
            '1 аніматор 20 хвилин': 1000,
            '2 аніматори 20 хвилин': 1200
        }
    }
}

OPIS_DODATKOVI={
    'Київ': {
        '🎭 Шоу': {
            'ПАПЕРОВЕ ШОУ': 'ОПИС 1',
            'ШОУ ПРУЖИНИ': 'ОПИС 2',
            'ТЕСЛА ШОУ': 'ОПИС 3',
            'НАУКОВИЙ МІКС': 'ОПИС 4',
            'CRAZY CRIO': 'ОПИС 5',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'ОПИС 6',
            'ШОУ ФОКУСІВ': 'ОПИС 7',
            'ПІННА ВЕЧІРКА': 'ОПИС 8'
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': 'ОПИС 9',
            'Слайми - 1 дитина': 'ОПИС 10',
            'Термомозаїка - 1 дитина': 'ОПИС 11',
            'Бомбочки для ванни - 1 дитина': 'ОПИС 12',
            'Шиммер коктейлі - 1 дитина': 'ОПИС 13',
            'Шоколадний попіт - 1 дитина': 'ОПИС 14',
            'Свічки - 1 дитина': 'ОПИС 15',
            'Мило - 1 дитина': 'ОПИС 16',
            'Пряники - 1 дитина': 'ОПИС 17',
            'Солодкі букети - 1 дитина': 'ОПИС 18',
            'Морозиво до 10 дітей': 'ОПИС 19',
            'Морозиво до 20 дітей': 'ОПИС 20',
            'Солодка вата до 10 дітей': 'ОПИС 21',
            'Солодка вата до 20 дітей': 'ОПИС 22'
        },
        '🎨 Декор': {
            'Базовий декор від': 'ОПИС 23',
            'Люкс декор від': 'ОПИС 24'
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від:': 'ОПИС 25',
            'Фігурна пін\'ята - від:': 'ОПИС 26'
        },
        '🎁 Експрес привітання':{
            '1 аніматор 20 хвилин': 'ОПИС 27',
            '2 аніматори 20 хвилин': 'ОПИС 28'
        }
    },
    'Кривий Ріг': {
        '🎭 Шоу': {
            'ШДМ шоу': 'ОПИС 29',
            'Шоу пружини': 'ОПИС 30',
            'Паперове шоу': 'ОПИС 31',
            'Шоу фокусів': 'ОПИС 32',
            'Шоу мильних бульбашок': 'ОПИС 33',
            'Треш шоу': 'ОПИС 34',
            'Хімічне шоу': 'ОПИС 35',
            'Тесла шоу': 'ОПИС 36',
            'Фабрика сюрпризів': 'ОПИС 37',
            'Пінна вечірка': 'ОПИС 38'
        },
        '🎨 Майстер-клас': {
            'МАЙСТЕР': 'ОПИС 39',
            'Створення амулетів - 1 дитина': 'ОПИС 40',
            'Солодкі букети - 1 дитина': 'ОПИС 41',
            'Слайми - 1 дитина': 'ОПИС 42',
            'Термомозаїка - 1 дитина': 'ОПИС 43',
            'Бомбочки для ванни - 1 дитина': 'ОПИС 44',
            'Шиммер коктейлі - 1 дитина': 'ОПИС 45',
            'Льодяники з ізомальту - 1 дитина': 'ОПИС 46',
            'Шоколадний попіт - 1 дитина': 'ОПИС 47',
            'Свічки - 1 дитина': 'ОПИС 48',
            'Мило - 1 дитина': 'ОПИС 49',
            'Пряники - 1 дитина': 'ОПИС 50',
            'BEARBRICK - 1 дитина': 'ОПИС 51',
            'Твістінг до 10 дітей': 'ОПИС 52',
            'Твістінг до 20 дітей': 'ОПИС 53',
            'Морозиво до 10 дітей': 'ОПИС 54',
            'Морозиво до 20 дітей': 'ОПИС 55',
            'Солодка вата до 10 дітей': 'ОПИС 56',
            'Солодка вата до 20 дітей': 'ОПИС 57'
        },
        '🎨 Декор': {
            'Базовий декор від': 'ОПИС 58',
            'Люкс декор від': 'ОПИС 59'
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від: ': 'ОПИС 60',
            'Велика пін\'ята - від: ': 'ОПИС 61'
        },
        '🎁 Експрес привітання':{
            '1 аніматор 20 хвилин': 'ОПИС 62',
            '2 аніматори 20 хвилин': 'ОПИС 63'
        }
    }
}

# Прості додаткові послуги (одна кнопка - одне додавання)
ADDITIONAL_SERVICES_SINGLE = {
    'Київ': {
        '💦 Аквагрим (до 10 дітей)': 1000,
        '💃 Глітер тату (до 10 дітей)': 1000,
        '🎂 Торти 1 кг': 1000,
        '📢 Колонка з мікрофоном від': 800,
        '💡 ДИСКО СВІТЛО': 800,
        '🐻 Білий ведмедик (+дорога)': 1100,
        '🕺 Дзеркальні люди (двоє) 1 година': 1500,
        '🐦 Птахи (двоє) 1 година': 1500,
        '🎵 Діджей 1 г': 4000,
        '🎥 Відеограф 1 г': 3000,
        '📸 Фотограф 1 г': 2500,
        '🎤 Ведучий 1 г': 4000,
        '🫧 Генератор мильних бульбашок': 1000,

    },
    'Кривий Ріг': {
        '💦 Аквагрим (до 10 дітей)': 1000,
        '💃 Глітер тату (до 10 дітей)': 1000,
        '🎂 Торти 1 кг': 1000,
        '📢 Колонка з мікрофоном від': 800,
        '💡 ДИСКО СВІТЛО': 800,
        '🐻 Білий ведмедик (+дорога)': 1100,
        '🕺 Дзеркальні люди (двоє) 1 година': 1500,
        '🐦 Птахи (двоє) 1 година': 1500,
        '🫧 Генератор мильних бульбашок':800,
        '🎵 Діджей 1 г': 2000,
        '🎥 Відеограф 1 г': 2500,
        '📸 Фотограф 1 г': 1800,
        '🎤 Ведучий 1 г': 1500
    }
}

service_with_photo = [
    '🫧 Генератор мильних бульбашок', 
    '💦 Аквагрим (до 10 дітей)',
    '🐻 Білий ведмедик (+дорога)',
    '🕺 Дзеркальні люди (двоє) 1 година',
    '🐦 Птахи (двоє) 1 година',
    '💃 Глітер тату (до 10 дітей)',
    '🎂 Торти 1 кг',
    '💡 ДИСКО СВІТЛО'
    ]

# Вартість таксі для різних районів (туди/назад)
TAXI_PRICES = {
    'Київ': {
        'Деснянський район': 350,
        'Дніпровський район': 350,
        'Солом\'янський район': 600,
        'Шевченківський район': 600,
        'Голосіївський район': 450,
        'Печерський район': 500,
        'Подільський район': 600,
        'Святошинський район': 600,
        'Дарницький район': 400,
        'Оболонський район': 450,
        'Інше': "По тарифу перевізника"  # Для інших районів
    },
    'Кривий Ріг': {
        'Довгинцівський район': 200,
        'Інгулецький район': 270,
        'Металургійний район': 150,
        'Покровський район': 270,
        'Саксаганський район': 220,
        'Тернівський район': 330,
        'Центрально-Міський район': 270,
        'Інше': "По тарифу перевізника"  # Для інших районів
    }
}

# Універсальне пояснення для майстер-класів
MASTER_CLASS_EXPLANATION = (
    "Майстер-клас — це творчий інтерактив для дітей, де кожен учасник створює власний унікальний виріб під керівництвом досвідченого майстра.\n\n"
    "Кожен майстер-клас розрахований на дітей різного віку, триває від 20 до 40 хвилин (залежно від обраної тематики) та включає всі необхідні матеріали.\n\n"
    "Це чудова можливість розкрити творчий потенціал, розвинути дрібну моторику, фантазію та отримати позитивні емоції!\n\n"
    "Вартість вказана за одну дитину або групу (див. варіанти нижче)."
)
