import os
import logging
from dotenv import load_dotenv

# Налаштування логування
logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)
logger = logging.getLogger(__name__)

# Завантаження змінних середовища
load_dotenv()

# Telegram конфігурація
TELEGRAM_BOT_TOKEN = os.getenv('TELEGRAM_BOT_TOKEN')

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")


#Привітання з користувачем
Hello_World = "🎉 Вітаємо у Confetti - вашому провіднику у світ незабутніх свят!\n\nОберіть місто, де ви хочете організувати свято:"

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']

# Типи подій
EVENT_TYPES = {
    '🎂 День народження': 'День народження',
    '📅 Афіша подій': 'Афіша подій',
    '🎓 Випускний': 'Випускний',
    '👨‍👩‍👧‍👦 Сімейне свято': 'Сімейне свято',
    '🎯 Інше': 'Інше'
}

# Список типів подій для клавіатури
EVENT_TYPES_LIST = list(EVENT_TYPES.keys())

# Інформація про канали міст
CITY_CHANNELS = {
    'Київ': 'https://t.me/confetti_kyiv',
    'Кривий Ріг': 'https://t.me/confetti_kr'
}

# Загальна інформація для розділу "Інше"
GENERAL_INFO = {
    'Київ': (
        "🌟 Confetti у Києві - це:\n\n"
        "🎭 Професійні аніматори\n"
        "🎨 Яскраві шоу-програми\n"
        "🎪 Організація свят під ключ\n"
        "🎁 Особливий підхід до кожного клієнта\n\n"
        "Наші послуги доступні по всьому Києву та області!"
    ),
    'Кривий Ріг': (
        "🌟 Confetti у Кривому Розі - це:\n\n"
        "🎭 Креативні аніматори\n"
        "🎨 Унікальні програми\n"
        "🎪 Повна організація свят\n"
        "🎁 Індивідуальний підхід\n\n"
        "Працюємо по всьому місту та передмістю!"
    )
}

# Контактна інформація менеджера
MANAGER_INFO = {
    'Київ': {
        'phone': '+380123456789',
        'telegram': 'https://t.me/manager_kyiv',
        'name': 'Поліна'
    },
    'Кривий Ріг': {
        'phone': '+380987654321',
        'telegram': 'https://t.me/manager_kr',
        'name': 'Поліна'
    }
}

# Повідомлення для контактів менеджера
MANAGER_CONTACT_MESSAGES = {
    'Київ': (
        "👋 Вас вітає менеджер Confetti-bot у Києві!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n" 
        "📞 Телефон: {phone}\n"
        "👤 Менеджер: {name}\n"
        "📱 Telegram: {telegram}\n\n"
        "Працюємо щодня з 9:00 до 20:00"
    ),
    'Кривий Ріг': (
        "🎈 Confetti-bot Кривий Ріг вітає вас!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n"        
        "👤 Менеджер: {name}\n"
        "📱 Telegram: {telegram}\n\n"
        "Чекаємо на ваше звернення з 9:00 до 19:00"
    )
}

# Отримання та конвертація ID менеджера
try:
    MANAGER_CHAT_ID = int(os.getenv('MANAGER_CHAT_ID'))
    logger.info(f"ID менеджера успішно завантажено: {MANAGER_CHAT_ID}")
except (TypeError, ValueError) as e:
    logger.error(f"Помилка при завантаженні ID менеджера: {str(e)}")
    MANAGER_CHAT_ID = None

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")
if not MANAGER_CHAT_ID:
    logger.error("Не знайдено ID менеджера в змінних середовища")

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']





# Шляхи до PDF файлів з місцями проведення
LOCATION_PDF_FILES = {
    'Київ': 'матеріали/місця проведення/locations_київ.pdf',
    'Кривий Ріг': 'матеріали/місця проведення/locations_кривий_ріг.pdf'
}

# Локації для різних типів подій
LOCATIONS = {
    '🎂 День народження': [
        '🏠 Вдома',
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ],
    '🎓 Випускний': [
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ]
}

# Інформація про локації
LOCATION_INFO = {
    'Київ': {
        '🏠 Вдома': 'Організуємо незабутнє свято у вас вдома!',
        '🍽 Ресторан/Кафе': 'Підберемо найкращий заклад для вашого свята',
        '🏫 Садочок/Школа': 'Організуємо свято в навчальному закладі',
        '🏰 Заміський комплекс': 'Чудовий відпочинок за містом',
        '📍 Інше': 'Допоможемо з вибором будь-якого місця'
    },
    'Кривий Ріг': {
        '🏠 Вдома': 'Створимо атмосферу свята у вашій оселі!',
        '🍽 Ресторан/Кафе': 'Знайдемо ідеальний заклад для святкування',
        '🏫 Садочок/Школа': 'Організуємо свято в навчальному закладі',
        '🏰 Заміський комплекс': 'Відпочинок на природі з розвагами',
        '📍 Інше': 'Допоможемо з вибором оптимального місця'
    }
}

# Тематики свят
THEMES = [
    '🏰 Казкові герої',
    '🎮 Game Party',
    '🦸‍♂️ Супергерої',
    '🎉 Вечірка',
    '📞 Зв\'язатись з менеджером'
]

# Опис тематик
THEME_INFO = {
    '🏰 Казкові герої': 'Улюблені персонажі казок оживуть на вашому святі! '
                        'Принцеси, дракони, чарівники та інші казкові герої '
                        'створять незабутню атмосферу.',
    
    '🎮 Game Party': 'Вечірка в стилі улюблених відеоігор! '
                    'Minecraft, Roblox, Among Us та інші популярні ігри '
                    'стануть частиною вашого свята.',
    
    '🦸‍♂️ Супергерої': 'Захоплююча пригода з супергероями! '
                      'Spider-Man, Batman, Wonder Woman та інші герої '
                      'завітають на ваше свято.',
    
    '🎉 Вечірка': 'Яскрава вечірка з сучасною музикою, танцями та розвагами! '
                  'Створимо драйвову атмосферу для незабутнього святкування.'
} 

THEME_BTN = {
    '🏰 Казкові герої': [
        'Сонік та Емі',
        'Барбі та Кен',
        'Лісова казка',
        'Уенсдей',
        'Єдиноріжки',
        'Крижане серце',
        'Paw Patrol',
        'Міккі та Мінні',
        'Леді Баг та Супер Кіт',
        'Аліса та Капелюшник',
        'Гаррі Поттер та Герміона',
        'Ляльки Лол',
        'Принцеса Аврора та Принц Філіпп',
        'Малефісента',
        'Літл Поні',
        'Феї Winx',
        'Герої в масках',
        'Лалафанфан',
        'Білий ведмедик',
        'Зоотрополіс',
        'Тролі',
        'Три коти',
        'Тачки',
        'Моана та Мауї',
        'Пеппа та Джордж',
        'Сofія Прекрасна',
        'Котяча вечірка',
        'Рапунцель',
        'Посіпаки',
        'Маша і Ведмідь',
        'Фіксики',
        'Монстри на канікулах',
        'Лего Ніндзяго',
        'Русалонька та Коник',
    ],
    
    '🎮 Game Party': [
        'Roblox',
        'Brawl stars',
        'Minecraft',
        'Among us',
    ],
    
    '🦸‍♂️ Супергерої': [
        'Залізна Людина та Диво Жінка',
        'Людина Павук та Жінка Кішка',
        'Супермен та Супервумен',
        'Трансформери',
        'Бетмен',
        'Капітан Америка та Залізна Людина',
        'Черепашки Ніндзя',
    ],
    
    '🎉 Вечірка': [
        'Спортивна',
        'Морська',
        'Sweet Party',
        'K-Pop',   
        'Tik-tok party', 
        'Safari party', 
        'Секретна лабораторія', 
        'Перший мільйон', 
        'Pop-it party', 
        'Smile party', 
        'Космічна', 
        'Французька', 
        'Футбольна', 
        'Голівуд',
        'Гра в кальмара',
    ]
} 


# Посилання на фото для підтем
THEME_PHOTOS = {
    '🏰 Казкові герої': {
        'Сонік та Емі': 'матеріали/images/казкові_герої/1.png',
        'Барбі та Кен': 'матеріали/images/казкові_герої/1.png',
        'Лісова казка': 'матеріали/images/казкові_герої/1.png',
        'Уенсдей': 'матеріали/images/казкові_герої/1.png',
        'Єдиноріжки': 'матеріали/images/казкові_герої/1.png',
        'Крижане серце': 'матеріали/images/казкові_герої/1.png',
        'Paw Patrol': 'матеріали/images/казкові_герої/1.png',
        'Міккі та Мінні': 'матеріали/images/казкові_герої/1.png',
        'Леді Баг та Супер Кіт': 'матеріали/images/казкові_герої/1.png',
        'Аліса та Капелюшник': 'матеріали/images/казкові_герої/1.png',
        'Гаррі Поттер та Герміона': 'матеріали/images/казкові_герої/1.png',
        'Ляльки Лол': 'матеріали/images/казкові_герої/1.png',
        'Принцеса Аврора та Принц Філіпп': 'матеріали/images/казкові_герої/1.png',
        'Малефісента': 'матеріали/images/казкові_герої/1.png',
        'Літл Поні': 'матеріали/images/казкові_герої/1.png',
        'Феї Winx': 'матеріали/images/казкові_герої/1.png',
        'Герої в масках': 'матеріали/images/казкові_герої/1.png',
        'Лалафанфан': 'матеріали/images/казкові_герої/1.png',
        'Білий ведмедик': 'матеріали/images/казкові_герої/1.png',
        'Зоотрополіс': 'матеріали/images/казкові_герої/1.png',
        'Тролі': 'матеріали/images/казкові_герої/1.png',
        'Три коти': 'матеріали/images/казкові_герої/1.png',
        'Тачки': 'матеріали/images/казкові_герої/1.png',
        'Моана та Мауї': 'матеріали/images/казкові_герої/1.png',
        'Пеппа та Джордж': 'матеріали/images/казкові_герої/1.png',
        'Сofія Прекрасна': 'матеріали/images/казкові_герої/1.png',
        'Котяча вечірка': 'матеріали/images/казкові_герої/1.png',
        'Рапунцель': 'матеріали/images/казкові_герої/1.png',
        'Посіпаки': 'матеріали/images/казкові_герої/1.png',
        'Маша і Ведмідь': 'матеріали/images/казкові_герої/1.png',
        'Фіксики': 'матеріали/images/казкові_герої/1.png',
        'Монстри на канікулах': 'матеріали/images/казкові_герої/1.png',
        'Лего Ніндзяго': 'матеріали/images/казкові_герої/1.png',
        'Русалонька та Коник': 'матеріали/images/казкові_герої/1.png',
    },
    '🎮 Game Party': {
        'Roblox': 'матеріали/images/game_party/1.png',
        'Brawl stars': 'матеріали/images/game_party/1.png',
        'Minecraft': 'матеріали/images/game_party/1.png',
        'Among us': 'матеріали/images/game_party/1.png',
    },
    '🦸‍♂️ Супергерої': {
        'Залізна Людина та Диво Жінка': 'матеріали/images/супергерої/1.png',
        'Людина Павук та Жінка Кішка': 'матеріали/images/супергерої/1.png',
        'Супермен та Супервумен': 'матеріали/images/супергерої/1.png',
        'Трансформери': 'матеріали/images/супергерої/1.png',
        'Бетмен': 'матеріали/images/супергерої/1.png',
        'Капітан Америка та Залізна Людина': 'матеріали/images/супергерої/1.png',
        'Черепашки Ніндзя': 'матеріали/images/супергерої/1.png',
    },
    '🎉 Вечірка': {
        'Спортивна': 'матеріали/images/вечірка/1.png',
        'Морська': 'матеріали/images/вечірка/1.png',
        'Sweet Party': 'матеріали/images/вечірка/1.png',
        'K-Pop': 'матеріали/images/вечірка/1.png',
        'Tik-tok party': 'матеріали/images/вечірка/1.png',
        'Safari party': 'матеріали/images/вечірка/1.png',
        'Секретна лабораторія': 'матеріали/images/вечірка/1.png',
        'Перший мільйон': 'матеріали/images/вечірка/1.png',
        'Pop-it party': 'матеріали/images/вечірка/1.png',
        'Smile party': 'матеріали/images/вечірка/1.png',
        'Космічна': 'матеріали/images/вечірка/1.png',
        'Французька': 'матеріали/images/вечірка/1.png',
        'Футбольна': 'матеріали/images/вечірка/1.png',
        'Голівуд': 'матеріали/images/вечірка/1.png',
        'Гра в кальмара': 'матеріали/images/вечірка/1.png',
    }
} 

# Формати свята
EVENT_FORMATS = {
    '⏰ Погодинно': 'Погодинна оплата',
    '📦 Пакетні пропозиції': 'Пакетні пропозиції',
    '🎯 Квести': 'Квести'
} 

# Конфігурація погодинних цін
HOURLY_PRICES = {
    'Київ': {
        '🎂 День народження': {
            '2 аніматори': 3500,
            '2 аніматори 2 години': 7000,
            '2 аніматори 3 години': 10500,
            '2 аніматори 4 години': 14000
        },
        '🎓 Випускний': {
            'Базова ціна': 4500,
            '3 години': 5500,
            '4 години': 6500
        },
        '🎂 День народження (турбаза)': {
            '1 аніматор (від 2 годин)': 6000,
            '2 аніматори (від 2 годин)': 7000,
            '2 аніматори ростові (від 2 годин)': 8000,
            '3 аніматори (від 2 годин)': 9000
        },
        '🎓 Випускний (турбаза)': {
            'Базова ціна (від 2 годин)': 9000,
            '3 години': 11000,
            '4 години': 13000
        }
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            '2 аніматори 1 година': 1800,
            '2 аніматори 2 години': 1800*2,
            '2 аніматори 3 години': 1800*3,
            '2 аніматори 4 години': 1800*4
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 2200,
            '3 години': 5500,
            '4 години': 6500
        },
        '🎂 День народження (турбаза)': {
            '1 аніматор (від 2 годин)': 2600,
            '2 аніматори (від 2 годин)': 3600,
            '3 аніматори (від 2 годин)': 5000
        },
        '🎓 Випускний (турбаза)': {
            'Базова ціна (від 2 годин)': 4400,
            '3 години': 5500,
            '4 години': 6500
        }
    }
}

PAKET_PRICES = {
    'Київ': {
        '🎂 День народження': {
            'Лайтовий 1.5 годин': 5000,
            'Magic 1.5 годин': 5500,
            'Frosty 1.5 годин': 6000,
            'Основний 2 години': 6000,
            'Magic 2 години': 7000,
            'Fun 2 години': 7000,
            'Frosty 2 години': 8000,
            'Комплексний 3 години': 8500,
            'Quest 2 години': 9000,
            'Топовий 3 години': 10000,
            'Квестовий': 12000,
            'Pop-dance 3 години': 10000
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 3300,
            'Color 1.5 годин': 4000,
            'WoW 1.5 годин': 4500  
        }   
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            'Святковий ': 2900,
            'Особливий': 3900,
            'Творчий': 5500,
            'Magic': 2900,
            'Frosty': 3500,
            'Quest': 4000,
            'Fun': 4000,
            'Quest': 4500,
            'Pop-dance': 5500
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 3400,
            'Color 1.5 годин': 4000,
            'WoW 1.5 годин': 4500  
        }     
    }
}

# Посилання на фото для пакетів
PAKET_PHOTOS = {
    'Київ': {
        '🎂 День народження': {
            'Лайтовий 1.5 годин': 'матеріали/images/Пакети/1.png',
            'Magic 1.5 годин': 'матеріали/images/Пакети/1.png',
            'Frosty 1.5 годин': 'матеріали/images/Пакети/1.png',
            'Основний 2 години': 'матеріали/images/Пакети/1.png',
            'Magic 2 години': 'матеріали/images/Пакети/1.png',
            'Fun 2 години': 'матеріали/images/Пакети/1.png',
            'Frosty 2 години': 'матеріали/images/Пакети/1.png',
            'Комплексний 3 години': 'матеріали/images/Пакети/1.png',
            'Quest 2 години': 'матеріали/images/Пакети/1.png',
            'Топовий 3 години': 'матеріали/images/Пакети/1.png',
            'Квестовий': 'матеріали/images/Пакети/1.png',
            'Pop-dance 3 години': 'матеріали/images/Пакети/1.png'
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 'матеріали/images/Пакети/1.png',
            'Color 1.5 годин': 'матеріали/images/Пакети/1.png',
            'WoW 1.5 годин': 'матеріали/images/Пакети/1.png'
        }
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            'Святковий': 'матеріали/images/Пакети/1.png',
            'Особливий': 'матеріали/images/Пакети/1.png',
            'Творчий': 'матеріали/images/Пакети/1.png',
            'Magic': 'матеріали/images/Пакети/1.png',
            'Frosty': 'матеріали/images/Пакети/1.png',
            'Quest': 'матеріали/images/Пакети/1.png',
            'Fun': 'матеріали/images/Пакети/1.png',
            'Pop-dance': 'матеріали/images/Пакети/1.png'
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 'матеріали/images/Пакети/1.png',
            'Color 1.5 годин': 'матеріали/images/Пакети/1.png',
            'WoW 1.5 годин': 'матеріали/images/Пакети/1.png'
        }
    }
}

QWEST = {
    'Київ': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'НАВКОЛО СВІТУ (6+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ДЖУНГЛІ (10+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 8500,
            '2 години': 9500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 8500,
            '2 години': 9500
        },
        'КВЕСТ ПАТІ (10+ років)': {
            '1,5 години': 10000,
            '2 години': 13000
        }
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'НАВКОЛО СВІТУ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЖУНГЛІ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЖИТАЛІ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'МОРСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        }
    }
}

# Посилання на фото для квестів
QWEST_PHOTOS = {
    'САФАРІ (5-7 років)': 'матеріали/images/квести/1.png',
    'НАВКОЛО СВІТУ (6+ років)': 'матеріали/images/квести/1.png',
    'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'матеріали/images/квести/1.png',
    'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'матеріали/images/квести/1.png',
    'ДЕТЕКТИВНИЙ (8+ років)': 'матеріали/images/квести/1.png',
    'PLAYDAY (7+ років)': 'матеріали/images/квести/1.png',
    'GIRLS TIME (5+ років)': 'матеріали/images/квести/1.png',
    'ДЖУНГЛІ (10+ років)': 'матеріали/images/квести/1.png',
    'В СВІТІ ДІСНЕЙ (5+ років)': 'матеріали/images/квести/1.png',
    'ВЕНСДЕЙ (7+ років)': 'матеріали/images/квести/1.png',
    'ГАРРІ ПОТТЕР (7+ років)': 'матеріали/images/квести/1.png',
    'КРИЖАНЕ СЕРЦЕ (6+ років)': 'матеріали/images/квести/1.png',
    'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'матеріали/images/квести/1.png',
    'ЕЛІКСИР ЩАСТЯ (10+ років)': 'матеріали/images/квести/1.png',
    'КВЕСТ ПАТІ (10+ років)': 'матеріали/images/квести/1.png',
    'ДЖИТАЛІ (10+ років)': 'матеріали/images/квести/1.png',
    'МОРСЬКИЙ (5-7 років)': 'матеріали/images/квести/1.png'
}

# Фотографії для додаткових послуг
ADDITIONAL_SERVICES_PHOTOS = {
    'ШОУ': {
        'ПАПЕРОВЕ ШОУ': 'матеріали/images/квести/1.png',
        'ШОУ ПРУЖИНИ': 'матеріали/images/квести/1.png',
        'ТЕСЛА ШОУ': 'матеріали/images/квести/1.png',
        'НАУКОВИЙ МІКС': 'матеріали/images/квести/1.png',
        'CRAZY CRIO': 'матеріали/images/квести/1.png',
        'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/квести/1.png',
        'ШОУ ФОКУСІВ': 'матеріали/images/квести/1.png',
        'ПІННА ВЕЧІРКА': 'матеріали/images/квести/1.png',
        'ШДМ шоу': 'матеріали/images/квести/1.png',
        'Шоу пружини': 'матеріали/images/квести/1.png',
        'Паперове шоу': 'матеріали/images/квести/1.png',
        'Шоу фокусів': 'матеріали/images/квести/1.png',
        'Шоу мильних бульбашок': 'матеріали/images/квести/1.png',
        'Треш шоу': 'матеріали/images/квести/1.png',
        'Хімічне шоу': 'матеріали/images/квести/1.png',
        'Тесла шоу': 'матеріали/images/квести/1.png',
        'Фабрика сюрпризів': 'матеріали/images/квести/1.png',
        'Пінна вечірка': 'матеріали/images/квести/1.png'
    },
    'МАЙСТЕР-КЛАС': {
        'Створення амулетів': 'матеріали/images/квести/1.png',
        'Слайми': 'матеріали/images/квести/1.png',
        'Термомозаїка': 'матеріали/images/квести/1.png',
        'Бомбочки для ванни': 'матеріали/images/квести/1.png',
        'Шиммер коктейлі': 'матеріали/images/квести/1.png',
        'Шоколадний попіт': 'матеріали/images/квести/1.png',
        'Свічки': 'матеріали/images/квести/1.png',
        'Мило': 'матеріали/images/квести/1.png',
        'Пряники': 'матеріали/images/квести/1.png',
        'Солодкі букети': 'матеріали/images/квести/1.png',
        'Морозиво': 'матеріали/images/квести/1.png',
        'Солодка вата': 'матеріали/images/квести/1.png',
        'МАЙСТЕР': 'матеріали/images/квести/1.png',
        'Льодяники з ізомальту': 'матеріали/images/квести/1.png',
        'BEARBRICK': 'матеріали/images/квести/1.png',
        'Твістінг': 'матеріали/images/квести/1.png'
    },
    'ДЕКОР': {
        'Базовий декор': 'матеріали/images/квести/1.png',
        'Стандартний декор': 'матеріали/images/квести/1.png',
        'Преміум декор': 'матеріали/images/квести/1.png'
    },
    'ПІНЬЯТИ': {
        'Базовий пакет': 'матеріали/images/квести/1.png',
        'Стандартний пакет': 'матеріали/images/квести/1.png',
        'Преміум пакет': 'матеріали/images/квести/1.png'
    },
    'ГЕНЕРАТОР': {
        '🫧 Генератор мильних бульбашок': 'матеріали/images/квести/1.png'
    }
}

# Додаткові послуги з підменю
ADDITIONAL_SERVICES_WITH_SUBMENU = {
    'Київ': {
        '🎭 Шоу': {
            'ПАПЕРОВЕ ШОУ': 2500,
            'ШОУ ПРУЖИНИ': 4000,
            'ТЕСЛА ШОУ': 4500,
            'НАУКОВИЙ МІКС': 4500,
            'CRAZY CRIO': 4500,
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 6000,
            'ШОУ ФОКУСІВ': 6000,
            'ПІННА ВЕЧІРКА': 7000
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': 250,
            'Слайми - 1 дитина': 250,
            'Термомозаїка - 1 дитина': 250,
            'Бомбочки для ванни - 1 дитина': 250,
            'Шиммер коктейлі - 1 дитина': 250,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 300,
            'Мило - 1 дитина': 350,
            'Пряники - 1 дитина': 350,
            'Солодкі букети - 1 дитина': 350,
            'Морозиво до 10 дітей': 3500,
            'Морозиво до 20 дітей': 4500,
            'Солодка вата до 10 дітей': 3500,
            'Солодка вата до 20 дітей': 4000
        },
        '🎨 Декор': {
            'Базовий декор': 3000,
            'Стандартний декор': 5000,
            'Преміум декор': 8000
        },
        '🎈 Пін\'яти': {
            'Базовий пакет (10 пін\'ят)': 1500,
            'Стандартний пакет (20 пін\'ят)': 2500,
            'Преміум пакет (30 пін\'ят)': 3500
        },
        '🎁 Єкспрес привітання':{
            '1 аніматор 20 хвилин': 2000,
            '2 аніматори 20 хвилин': 3000
        }
    },
    'Кривий Ріг': {
        '🎭 Шоу': {
            'ШДМ шоу': 2500,
            'Шоу пружини': 2500,
            'Паперове шоу': 2500,
            'Шоу фокусів': 2700,
            'Шоу мильних бульбашок': 2900,
            'Треш шоу': 3200,
            'Хімічне шоу': 3200,
            'Тесла шоу': 3500,
            'Фабрика сюрпризів': 3500,
            'Пінна вечірка': 4500
        },
        '🎨 Майстер-клас': {
            'МАЙСТЕР': 800,
            'Створення амулетів - 1 дитина': 150,
            'Солодкі букети - 1 дитина': 200,
            'Слайми - 1 дитина': 200,
            'Термомозаїка - 1 дитина': 200,
            'Бомбочки для ванни - 1 дитина': 200,
            'Шиммер коктейлі - 1 дитина': 200,
            'Льодяники з ізомальту - 1 дитина': 200,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 250,
            'Мило - 1 дитина': 250,
            'Пряники - 1 дитина': 300,
            'BEARBRICK - 1 дитина': 500,
            'Твістінг до 10 дітей': 500,
            'Твістінг до 20 дітей': 800,
            'Морозиво до 10 дітей': 2000,
            'Морозиво до 20 дітей': 3000,
            'Солодка вата до 10 дітей': 2000,
            'Солодка вата до 20 дітей': 3000
        },
        '🎨 Декор': {
            'Базовий декор': 2500,
            'Стандартний декор': 4500,
            'Преміум декор': 7000
        },
        '🎈 Пін\'ят': {
            'Базовий пакет': 900,
            'Стандартний пакет': 1500,
            'Преміум пакет': 2500
        },
        '🎁 Єкспрес привітання':{
            '1 аніматор 20 хвилин': 1000,
            '2 аніматори 20 хвилин': 1200
        }
    }
}

# Прості додаткові послуги (одна кнопка - одне додавання)
ADDITIONAL_SERVICES_SINGLE = {
    'Київ': {
        '🎵 Діджей': 2000,
        '🎥 Відеограф': 4000,
        '📸 Фотограф': 3000,
        '🎤 Ведучий': 2500,
        '🫧 Генератор мильних бульбашок': 1000
    },
    'Кривий Ріг': {
        '🫧 Генератор мильних бульбашок':800,
        '🎵 Діджей від 2 годин': '2000/годину',
        '🎥 Відеограф': 2500,
        '📸 Фотограф': 1800,
        '🎤 Ведучий': 1500
    }
}


# Вартість таксі для різних районів (туди/назад)
TAXI_PRICES = {
    'Київ': {
        'Деснянський район': 600,
        'Дніпровський район': 600,
        'Солом\'янський район': 500,
        'Шевченківський район': 500,
        'Голосіївський район': 600,
        'Печерський район': 500,
        'Подільський район': 500,
        'Святошинський район': 700,
        'Дарницький район': 700,
        'Оболонський район': 600,
        'Інше': "По тарифу перевізника"  # Для інших районів
    },
    'Кривий Ріг': {
        'Довгинцівський район': 300,
        'Інгулецький район': 400,
        'Металургійний район': 400,
        'Покровський район': 500,
        'Саксаганський район': 400,
        'Тернівський район': 500,
        'Центрально-Міський район': 400,
        'Інше': "По тарифу перевізника"  # Для інших районів
    }
}






