import os
import logging
from dotenv import load_dotenv

# Налаштування логування
logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)
logger = logging.getLogger(__name__)

# Завантаження змінних середовища
load_dotenv()

# Telegram конфігурація
TELEGRAM_BOT_TOKEN = os.getenv('TELEGRAM_BOT_TOKEN')

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")



#Привітання з користувачем
Hello_World = "🎉 Вас вітає Bot Confetti - найкращий помічник в створенні незабутніх свят та подій!\n\nОберіть місто, де ви хочете організувати свято:"

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']

# Типи подій
EVENT_TYPES = {
    '🎂 День народження': 'День народження',
    '📅 Афіша подій': 'Афіша подій',
    '🎓 Випускний': 'Випускний',
    '👨‍👩‍👧‍👦 Сімейне свято': 'Сімейне свято',
    '🎯 Інше': 'Інше'
}
# Список типів подій для клавіатури
EVENT_TYPES_LIST = list(EVENT_TYPES.keys())

# Ціни/Кнопки на семейні свят
FAMALY_TRIP = {
    "Київ":{
        "Ведучій 1 г": 4000,
        "Ді-джей 1 г": 4000,
        "Бебісітер 1 г": 2000
    },
    "Кривий Ріг":{
        "Ведучій 1 г": 1500,
        "Ді-джей 1 г": 2000,
        "Бебісітер 1 г": 1800
    }
}

FAMILY_INFO = (
    "Ми можемо бути з вами на будь-якому сімейному святі та зробимо все, щоб дорослі відпочивали та спілкувались, а діти проводили час весело та під наглядом.\n\n"
    "Свята, на які нас запрошують:\n"
    "- Святкування одного року 🎂\n"
    "- Хрестини ✝️\n"
    "- Весілля 💏\n"
    "- Ювілей та інше 🎉"
)

FAMILY_INFO_INFO2 = (
    "Щоб дізнатися більш детальну інформацію або зробити замовлення - звертайтесь до менеджера 📲"
)



# Інформація про канали міст
CITY_CHANNELS = {
    'Київ': 'https://t.me/confetti_kyiv',
    'Кривий Ріг': 'https://t.me/confetti_kr'
}

# Загальна інформація для розділу "Інше"
GENERAL_INFO = {
    'Київ': (
        "🌟 Confetti у Києві - це:\n\n"
        "🎭 Професійні аніматори\n"
        "🎨 Яскраві шоу-програми\n"
        "🔑 Організація свят під ключ\n"
        "🎁 Особливий підхід до кожного клієнта\n\n"
        "Наші послуги доступні по всьому Києву та області!"
    ),
    'Кривий Ріг': (
        "🌟 Confetti у Кривому Розі - це:\n\n"
        "🎭 Креативні аніматори\n"
        "🎨 Унікальні програми\n"
        "🔑 Організація свят під ключ\n"
        "🎁 Індивідуальний підхід\n\n"
        "Працюємо по всьому місту та передмістю!"
    )
}

# Контактна інформація менеджера
MANAGER_INFO = {
    'Київ': {
        'phone': '+380976036768',
        'telegram': '@confetti_manager',
        'name': 'Поліна'
    },
    'Кривий Ріг': {
        'phone': '+380968308363',
        'telegram': '@confettimanager',
        'name': 'Поліна'
    }
}

# Повідомлення для контактів менеджера
MANAGER_CONTACT_MESSAGES = {
    'Київ': (
        "👋 Вас вітає менеджер Confetti-bot у Києві!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n" 
        "📞 Зателефонува: {phone}\n"
        "👤 Менеджер: {name}\n"
        "📱 Написати: {telegram}\n\n"
        "Працюємо щодня з 9:00 до 20:00"
    ),
    'Кривий Ріг': (
        "🎈 Confetti-bot Кривий Ріг вітає вас!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n"  
        "👤 Менеджер: {name}\n"
        "📞 Зателефонувати: {phone}\n"
        "📱 Написати: @confetti_manager\n\n"
        "👤 Менеджер: Андрій\n"
        "📞 Зателефонувати: +380973185979\n"
        "📱 Написати: {telegram}\n\n"
        "Чекаємо на ваше звернення з 9:00 до 20:00"
    )
}

# Отримання та конвертація ID менеджера
try:
    MANAGER_CHAT_ID = int(os.getenv('MANAGER_CHAT_ID'))
    logger.info(f"ID менеджера успішно завантажено: {MANAGER_CHAT_ID}")
except (TypeError, ValueError) as e:
    logger.error(f"Помилка при завантаженні ID менеджера: {str(e)}")
    MANAGER_CHAT_ID = None

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")
if not MANAGER_CHAT_ID:
    logger.error("Не знайдено ID менеджера в змінних середовища")

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']





# Шляхи до PDF файлів з місцями проведення
LOCATION_PDF_FILES = {
    'Київ': 'матеріали/місця проведення/locations_київ.pdf',
    'Кривий Ріг': 'матеріали/місця проведення/locations_кривий_ріг.pdf'
}

# Локації для різних типів подій
LOCATIONS = {
    '🎂 День народження': [
        '🏠 Вдома',
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ],
    '🎓 Випускний': [
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ]
}

# Інформація про локації
LOCATION_INFO = {
    'Київ': {
        '🏠 Вдома': 'Організуємо незабутнє свято у вас вдома!',
        '🍽 Ресторан/Кафе': 'Організуємо незабутнє свято у будь-якому кафе/ресторані, яке ви оберете!',
        '🏫 Садочок/Школа': 'Організуємо незабутнє свято в навчальному закладі!',
        '🏰 Заміський комплекс': 'Організуємо чудовий відпочинок за містом!',
        '📍 Інше': 'Допоможемо з вибором будь-якого місця'
    },
    'Кривий Ріг': {
        '🏠 Вдома': 'Створимо атмосферу свята у вашій оселі!',
        '🍽 Ресторан/Кафе': 'Організуємо незабутнє свято у будь-якому кафе/ресторані, яке ви оберете!',
        '🏫 Садочок/Школа': 'Організуємо незабутнє свято в навчальному закладі!',
        '🏰 Заміський комплекс': 'Організуємо чудовий відпочинок за містом!',
        '📍 Інше': 'Допоможемо з вибором оптимального місця'
    }
}

# Тематики свят
THEMES = [
    '🏰 Казкові герої',
    '🎮 Game Party',
    '🦸‍♂️ Супергерої',
    '🎉 Вечірка',
    '📞 Зв\'язатись з менеджером'
]

# Опис тематик
THEME_INFO = {
    '🏰 Казкові герої': 'Улюблені персонажі казок оживуть на вашому святі! '
                        'Принцеси, дракони, чарівники та інші казкові герої '
                        'створять незабутню атмосферу.',
    
    '🎮 Game Party': 'Вечірка в стилі улюблених відеоігор! '
                    'Minecraft, Roblox, Among Us та інші популярні ігри '
                    'стануть частиною вашого свята.',
    
    '🦸‍♂️ Супергерої': 'Захоплююча пригода з супергероями! '
                      'Spider-Man, Batman, Wonder Woman та інші герої '
                      'завітають на ваше свято.',
    
    '🎉 Вечірка': 'Яскрава вечірка з сучасною музикою, танцями та розвагами! '
                  'Створимо драйвову атмосферу для незабутнього святкування.'
} 

# --- Тематичні кнопки по містах ---
THEME_BTN = {
    'Київ': {
        '🏰 Казкові герої': [
            'Сонік та Емі',
            'Цифровий цирк',
            'Барбі та Кен',
            'Лісова казка',
            'Уенсдей',
            'Єдиноріжки',
            'Крижане серце',
            'Paw Patrol',
            'Міккі та Мінні',
            'Леді Баг та Супер Кіт',
            'Аліса та Капелюшник',
            'Гаррі Поттер та Герміона',
            'Ляльки Лол',
            'Принцеса Аврора та Принц Філіпп',
            'Малефісента',
            'Літл Поні',
            'Феї Winx',
            'Герої в масках',
            'Лалафанфан',
            'Білий ведмедик',
            'Зоотрополіс',
            'Тролі',
            'Три коти',
            'Тачки',
            'Моана та Мауї',
            'Пеппа та Джордж',
            'Сofія Прекрасна',
            'Котяча вечірка',
            'Рапунцель',
            'Посіпаки',
            'Маша і Ведмідь',
            'Фіксики',
            'Монстри на канікулах',
            'Лего Ніндзяго',
            'Русалонька та Коник',
        ],
        '🎮 Game Party': [
            'Roblox',
            'Brawl stars',
            'Minecraft',
            'Among us',
        ],
        '🦸‍♂️ Супергерої': [
            'Залізна Людина та Диво Жінка',
            'Людина Павук та Жінка Кішка',
            'Супермен та Супервумен',
            'Трансформери',
            'Бетмен',
            'Капітан Америка та Залізна Людина',
            'Черепашки Ніндзя',
        ],
        '🎉 Вечірка': [
            'Спортивна',
            'Морська',
            'Sweet Party',
            'K-Pop',   
            'Tik-tok party', 
            'Safari party', 
            'Секретна лабораторія', 
            'Перший мільйон', 
            'Pop-it party', 
            'Smile party', 
            'Космічна', 
            'Французька', 
            'Футбольна', 
            'Голівуд',
            'Гра в кальмара',
        ]
    },
    # Додайте інші міста за аналогією
    'Кривий Ріг': {
        '🏰 Казкові герої': [
            'Сонік та Емі',
            'Барбі та Кен',
            'Лісова казка',
            'Уенсдей',
            'Єдиноріжки',
            'Крижане серце',
            'Paw Patrol',
            'Міккі та Мінні',
            'Леді Баг та Супер Кіт',
            'Аліса та Капелюшник',
            'Гаррі Поттер та Герміона',
            'Ляльки Лол',
            'Принцеса Аврора та Принц Філіпп',
            'Малефісента',
            'Літл Поні',
            'Феї Winx',
            'Герої в масках',
            'Лалафанфан',
            'Білий ведмедик',
            'Зоотрополіс',
            'Тролі',
            'Три коти',
            'Тачки',
            'Моана та Мауї',
            'Пеппа та Джордж',
            'Сofія Прекрасна',
            'Котяча вечірка',
            'Рапунцель',
            'Посіпаки',
            'Маша і Ведмідь',
            'Фіксики',
            'Монстри на канікулах',
            'Лего Ніндзяго',
            'Русалонька та Коник',
        ],
        '🎮 Game Party': [
            'Roblox',
            'Brawl stars',
            'Minecraft',
            'Among us',
        ],
        '🦸‍♂️ Супергерої': [
            'Залізна Людина та Диво Жінка',
            'Людина Павук та Жінка Кішка',
            'Супермен та Супервумен',
            'Трансформери',
            'Бетмен',
            'Капітан Америка та Залізна Людина',
            'Черепашки Ніндзя',
        ],
        '🎉 Вечірка': [
            'Спортивна',
            'Морська',
            'Sweet Party',
            'K-Pop',   
            'Tik-tok party', 
            'Safari party', 
            'Секретна лабораторія', 
            'Перший мільйон', 
            'Pop-it party', 
            'Smile party', 
            'Космічна', 
            'Французька', 
            'Футбольна', 
            'Голівуд',
            'Гра в кальмара',
        ]
    }
} 

THEME_PHOTOS = {
    'Київ': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КИЇВ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КИЇВ/казкові_герої/Русалочка та коник.jpg',

            'Сонік та Емі': 'матеріали/images/КИЇВ/казкові_герої/Сонік.PNG',
            'Барбі та Кен': 'матеріали/images/КИЇВ/казкові_герої/Барбі і Кен.PNG',
            'Лісова казка': 'матеріали/images/КИЇВ/казкові_герої/Мавка і Лукаш.PNG',
            'Уенсдей': 'матеріали/images/КИЇВ/казкові_герої/венсдей.PNG',
            'Єдиноріжки': 'матеріали/images/КИЇВ/казкові_герої/Єдиноріжки.PNG',
            'Крижане серце': 'матеріали/images/КИЇВ/казкові_герої/Крижане серце.PNG',
            'Paw Patrol': 'матеріали/images/КИЇВ/казкові_герої/Paw Patrol.jpg',
            'Міккі та Мінні': 'матеріали/images/КИЇВ/казкові_герої/Міккі та Мінні.PNG',
            'Леді Баг та Супер Кіт': 'матеріали/images/КИЇВ/казкові_герої/Леді Баг.PNG',
            'Аліса та Капелюшник': 'матеріали/images/КИЇВ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КИЇВ/казкові_герої/Гаррі Поттер та Герміона.PNG',
            'Ляльки Лол': 'матеріали/images/КИЇВ/казкові_герої/Лол.PNG',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КИЇВ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КИЇВ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КИЇВ/казкові_герої/Літл Поні.PNG',
            'Феї Winx': 'матеріали/images/КИЇВ/казкові_герої/Феї.jpg',
            'Герої в масках': 'матеріали/images/КИЇВ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КИЇВ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КИЇВ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КИЇВ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КИЇВ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КИЇВ/казкові_герої/Три коти.PNG',
            'Тачки': 'матеріали/images/КИЇВ/казкові_герої/Тачки.PNG',
            'Моана та Мауї': 'матеріали/images/КИЇВ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КИЇВ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КИЇВ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КИЇВ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КИЇВ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КИЇВ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КИЇВ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КИЇВ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КИЇВ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КИЇВ/казкові_герої/Лего Ніндзяго.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КИЇВ/game_party/Roblox.PNG',
            'Brawl stars': 'матеріали/images/КИЇВ/game_party/Brawl stars.PNG',
            'Minecraft': 'матеріали/images/КИЇВ/game_party/Minecraft.PNG',
            'Among us': 'матеріали/images/КИЇВ/game_party/Among us.PNG',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КИЇВ/супергерої/Супергерої.PNG',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КИЇВ/супергерої/Супергерої.PNG',
            'Супермен та Супервумен': 'матеріали/images/КИЇВ/супергерої/Супергерої.PNG',
            'Трансформери': 'матеріали/images/КИЇВ/супергерої/Трансформери.PNG',
            'Бетмен': 'матеріали/images/КИЇВ/супергерої/Супергерої.PNG',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КИЇВ/супергерої/Супергерої.PNG',
            'Черепашки Ніндзя': 'матеріали/images/КИЇВ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КИЇВ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КИЇВ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КИЇВ/вечірка/Sweet Party.jpg',
            'K-Pop': 'матеріали/images/КИЇВ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КИЇВ/вечірка/Tik-tok party.PNG',
            'Safari party': 'матеріали/images/КИЇВ/вечірка/Safari party.PNG',
            'Секретна лабораторія': 'матеріали/images/КИЇВ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КИЇВ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КИЇВ/вечірка/Pop-it party.PNG',
            'Smile party': 'матеріали/images/КИЇВ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КИЇВ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КИЇВ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КИЇВ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КИЇВ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КИЇВ/вечірка/Гра в кальмара.jpg',
        }
    },
    'Кривий Ріг': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
            'Сонік та Емі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сонік та Емі.PNG',
            'Барбі та Кен': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Барбі та Кен.PNG',
            'Лісова казка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лісова казка.PNG',
            'Уенсдей': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/венсдей.PNG',
            'Єдиноріжки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Єдиноріжки.PNG',
            'Крижане серце': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Крижане серце.PNG',
            'Paw Patrol': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Paw Patrol.PNG',
            'Міккі та Мінні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Міккі та Мінні.PNG',
            'Леді Баг та Супер Кіт': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Леді Баг та Супер Кіт.PNG',
            'Аліса та Капелюшник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Гаррі Поттер та Герміона.PNG',
            'Ляльки Лол': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Ляльки Лол.PNG',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Літл Поні.PNG',
            'Феї Winx': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Феї Winx.jpg',
            'Герої в масках': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Три коти.PNG',
            'Тачки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тачки.PNG',
            'Моана та Мауї': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лего Ніндзяго.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КРИВИЙ РІГ/game_party/Roblox.PNG',
            'Brawl stars': 'матеріали/images/КРИВИЙ РІГ/game_party/Brawl stars.PNG',
            'Minecraft': 'матеріали/images/КРИВИЙ РІГ/game_party/Minecraft.PNG',
            'Among us': 'матеріали/images/КРИВИЙ РІГ/game_party/Among us.PNG',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супергерої.PNG',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супергерої.PNG',
            'Супермен та Супервумен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супергерої.PNG',
            'Трансформери': 'матеріали/images/КРИВИЙ РІГ/супергерої/Трансформери.PNG',
            'Бетмен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супергерої.PNG',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супергерої.PNG',
            'Черепашки Ніндзя': 'матеріали/images/КРИВИЙ РІГ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КРИВИЙ РІГ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Sweet Party.PNG',
            'K-Pop': 'матеріали/images/КРИВИЙ РІГ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Tik-tok party.PNG',
            'Safari party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Safari party.PNG',
            'Секретна лабораторія': 'матеріали/images/КРИВИЙ РІГ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КРИВИЙ РІГ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Pop-it party.PNG',
            'Smile party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КРИВИЙ РІГ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КРИВИЙ РІГ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КРИВИЙ РІГ/вечірка/Гра в кальмара.jpg',
        }
    }
}

# Формати свята
EVENT_FORMATS = {
    '⏰ Погодинно': 'Погодинна оплата',
    '📦 Пакетні пропозиції': 'Пакетні пропозиції',
    '🎯 Квести': 'Квести'
} 

# Конфігурація погодинних цін
HOURLY_PRICES = {
    'Київ': {
        '🎂 День народження': {
            '2 аніматори': 3500,
            '2 аніматори 2 години': 7000,
            '2 аніматори 3 години': 10500,
            '2 аніматори 4 години': 14000
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 3500
        },
        '🎂 День народження (турбаза)': {
            '2 аніматори': 3500
        },
        '🎓 Випускний (турбаза)': {
            '2 аніматори': 3500
        }
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            '2 аніматори 1 година': 1800,
            '2 аніматори 2 години': 1800*2,
            '2 аніматори 3 години': 1800*3,
            '2 аніматори 4 години': 1800*4
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 2200
        },
        '🎂 День народження (турбаза)': {
            '2 аніматори': 1800
        },
        '🎓 Випускний (турбаза)': {
            '2 аніматори': 2200
        }
    }
}  

PAKET_PRICES = {
    'Київ': {
        '🎂 День народження': {
            'Лайтовий 1.5 годин': 5000,
            'Magic 1.5 годин': 5500,
            'Frosty 1.5 годин': 6000,
            'Основний 2 години': 6000,
            'Magic 2 години': 7000,
            'Frosty 2 години': 8000,
            'Комплексний 3 години': 8500,
            'Топовий 3 години': 10000,
            'Квестовий': 12000,
            'Fun 2 години': 7000,
            'Quest 2 години': 9000,
            'Pop-dance 3 години': 10000
        },
        '🎓 Випускний': {
            'Розважальний (1.5 год)': 7500,
            'Вражаючий (2 год)': 8700,
            'Кольоровий (2 год)': 9700,
            'Драйвовий (2.5 год)': 11000  
        }   
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            'Святковий': 2900,
            'Особливий': 3900,
            'Творчий': 5500,
            'Magic': 2900,
            'Frosty': 3500,
            'Quest': 4000,
            'Fun': 4000,
            'Quest': 4500,
            'Pop-dance': 5500
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 3400,
            'Color 1.5 годин': 4000,
            'WoW 1.5 годин': 4500  
        }     
    }
}

# Посилання на фото для пакетів
PAKET_PHOTOS = {
    'Київ': {
        '🎂 День народження': {
            'Лайтовий 1.5 годин': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Magic 1.5 годин': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Frosty 1.5 годин': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Основний 2 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Magic 2 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Fun 2 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Frosty 2 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Quest 2 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Комплексний 3 години': 'матеріали/images/Пакети/КИЇВ/1.png',    
            'Топовий 3 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Pop-dance 3 години': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Квестовий': 'матеріали/images/Пакети/КИЇВ/1.png'
        },
        '🎓 Випускний': {
            'Розважальний (1.5 год)': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Вражаючий (2 год)': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Кольоровий (2 год)': 'матеріали/images/Пакети/КИЇВ/1.png',
            'Драйвовий (2.5 год)': 'матеріали/images/Пакети/КИЇВ/1.png'  
        }
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            
            'Святковий': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Особливий': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Творчий': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Magic': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Frosty': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Quest': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Fun': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png',
            'Pop-dance': 'матеріали/images/Пакети/КРИВИЙ РІГ/1.png'
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Study.jpg',
            'Color 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Color.jpg',
            'WoW 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/WOW.jpg'
        }
    }
}

QWEST = {
    'Київ': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'НАВКОЛО СВІТУ (6+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ДЖУНГЛІ (10+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 6500,
            '2 години': 8000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 8500,
            '2 години': 9500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 8500,
            '2 години': 9500
        },
        'КВЕСТ ПАТІ (10+ років)': {
            '1,5 години': 10000,
            '2 години': 13000
        }
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'НАВКОЛО СВІТУ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЖУНГЛІ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЖИТАЛІ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'МОРСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        }
    }
}



# Фотографії для додаткових послуг
ADDITIONAL_SERVICES_PHOTOS = {
    'Київ': {
        'ШОУ': {
            'ПАПЕРОВЕ ШОУ': 'матеріали/images/КИЇВ/квести/1.png',
            'ШОУ ПРУЖИНИ': 'матеріали/images/КИЇВ/квести/1.png',
            'ТЕСЛА ШОУ': 'матеріали/images/КИЇВ/квести/1.png',
            'НАУКОВИЙ МІКС': 'матеріали/images/КИЇВ/квести/1.png',
            'CRAZY CRIO': 'матеріали/images/КИЇВ/квести/1.png',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/КИЇВ/квести/1.png',
            'ШОУ ФОКУСІВ': 'матеріали/images/КИЇВ/квести/1.png',
            'ПІННА ВЕЧІРКА': 'матеріали/images/КИЇВ/квести/1.png',
            'ШДМ шоу': 'матеріали/images/КИЇВ/квести/1.png',
            'Шоу пружини': 'матеріали/images/КИЇВ/квести/1.png',
            'Паперове шоу': 'матеріали/images/КИЇВ/квести/1.png',
            'Шоу фокусів': 'матеріали/images/КИЇВ/квести/1.png',
            'Шоу мильних бульбашок': 'матеріали/images/КИЇВ/квести/1.png',
            'Треш шоу': 'матеріали/images/КИЇВ/квести/1.png',
            'Хімічне шоу': 'матеріали/images/КИЇВ/квести/1.png',
            'Тесла шоу': 'матеріали/images/КИЇВ/квести/1.png',
            'Фабрика сюрпризів': 'матеріали/images/КИЇВ/квести/1.png',
            'Пінна вечірка': 'матеріали/images/КИЇВ/квести/1.png'
        },
        'МАЙСТЕР-КЛАС': {
            'Створення амулетів': 'матеріали/images/КИЇВ/квести/1.png',
            'Слайми': 'матеріали/images/КИЇВ/квести/1.png',
            'Термомозаїка': 'матеріали/images/КИЇВ/квести/1.png',
            'Бомбочки для ванни': 'матеріали/images/КИЇВ/квести/1.png',
            'Шиммер коктейлі': 'матеріали/images/КИЇВ/квести/1.png',
            'Шоколадний попіт': 'матеріали/images/КИЇВ/квести/1.png',
            'Свічки': 'матеріали/images/КИЇВ/квести/1.png',
            'Мило': 'матеріали/images/КИЇВ/квести/1.png',
            'Пряники': 'матеріали/images/КИЇВ/квести/1.png',
            'Солодкі букети': 'матеріали/images/КИЇВ/квести/1.png',
            'Морозиво': 'матеріали/images/КИЇВ/квести/1.png',
            'Солодка вата': 'матеріали/images/КИЇВ/квести/1.png',
            'МАЙСТЕР': 'матеріали/images/КИЇВ/квести/1.png',
            'Льодяники з ізомальту': 'матеріали/images/КИЇВ/квести/1.png',
            'BEARBRICK': 'матеріали/images/КИЇВ/квести/1.png',
            'Твістінг': 'матеріали/images/КИЇВ/квести/1.png'
        },
        'ДЕКОР': {
            'Базовий декор': 'матеріали/images/КИЇВ/квести/1.png'
        },
        'ПІНЬЯТИ': {
            'Стандартна - від: ': 'матеріали/images/КИЇВ/піньяти/пінята.JPEG',
            'Фігурна - від: ': 'матеріали/images/КИЇВ/піньяти/пінята.JPEG'
        },
        'ГЕНЕРАТОР': {
            '🫧 Генератор мильних бульбашок': 'матеріали/images/КИЇВ/генератор/Бульбашки.JPEG'
        }
    },
    'Кривий Ріг': {
        'ШОУ': {
            'ПАПЕРОВЕ ШОУ': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'ШОУ ПРУЖИНИ': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'ТЕСЛА ШОУ': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'НАУКОВИЙ МІКС': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'CRAZY CRIO': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'ШОУ ФОКУСІВ': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'ПІННА ВЕЧІРКА': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'ШДМ шоу': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Шоу пружини': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Паперове шоу': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Шоу фокусів': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Шоу мильних бульбашок': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Треш шоу': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Хімічне шоу': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Тесла шоу': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Фабрика сюрпризів': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Пінна вечірка': 'матеріали/images/КРИВИЙ РІГ/квести/1.png'
        },
        'МАЙСТЕР-КЛАС': {
            'Створення амулетів': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Слайми': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Термомозаїка': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Бомбочки для ванни': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Шиммер коктейлі': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Шоколадний попіт': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Свічки': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Мило': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Пряники': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Солодкі букети': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Морозиво': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Солодка вата': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'МАЙСТЕР': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Льодяники з ізомальту': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'BEARBRICK': 'матеріали/images/КРИВИЙ РІГ/квести/1.png',
            'Твістінг': 'матеріали/images/КРИВИЙ РІГ/квести/1.png'
        },
        'ДЕКОР': {
            'Базовий декор': 'матеріали/images/КРИВИЙ РІГ/квести/1.png'
        },
        'ПІНЬЯТИ': {
            'Стандартна': 'матеріали/images/КИЇВ/піньяти/пінята.JPEG',
            'Велика': 'матеріали/images/КИЇВ/піньяти/пінята.JPEG'
        },
        'ГЕНЕРАТОР': {
            '🫧 Генератор мильних бульбашок': 'матеріали/images/КРИВИЙ РІГ/генератор/Бульбашки.JPEG'
        }
    }
}

# Додаткові послуги з підменю
ADDITIONAL_SERVICES_WITH_SUBMENU = {
    'Київ': {
        '🎭 Шоу': {
            'ПАПЕРОВЕ ШОУ': 2500,
            'ШОУ ПРУЖИНИ': 4000,
            'ТЕСЛА ШОУ': 4500,
            'НАУКОВИЙ МІКС': 4500,
            'CRAZY CRIO': 4500,
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 6000,
            'ШОУ ФОКУСІВ': 6000,
            'ПІННА ВЕЧІРКА': 7000
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': 250,
            'Слайми - 1 дитина': 250,
            'Термомозаїка - 1 дитина': 250,
            'Бомбочки для ванни - 1 дитина': 250,
            'Шиммер коктейлі - 1 дитина': 250,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 300,
            'Мило - 1 дитина': 350,
            'Пряники - 1 дитина': 350,
            'Солодкі букети - 1 дитина': 350,
            'Морозиво до 10 дітей': 3500,
            'Морозиво до 20 дітей': 4500,
            'Солодка вата до 10 дітей': 3500,
            'Солодка вата до 20 дітей': 4000
        },
        '🎨 Декор': {
            'Базовий декор': 7000
        },
        '🎈 Пін\'яти': {
            'Стандартна - від: ': 1500,
            'Фігурна - від: ': 0
        },
        '🎁 Єкспрес привітання':{
            '1 аніматор 20 хвилин': 2000,
            '2 аніматори 20 хвилин': 3000
        }
    },
    'Кривий Ріг': {
        '🎭 Шоу': {
            'ШДМ шоу': 2500,
            'Шоу пружини': 2500,
            'Паперове шоу': 2500,
            'Шоу фокусів': 2700,
            'Шоу мильних бульбашок': 2900,
            'Треш шоу': 3200,
            'Хімічне шоу': 3200,
            'Тесла шоу': 3500,
            'Фабрика сюрпризів': 3500,
            'Пінна вечірка': 4500
        },
        '🎨 Майстер-клас': {
            'МАЙСТЕР': 800,
            'Створення амулетів - 1 дитина': 150,
            'Солодкі букети - 1 дитина': 200,
            'Слайми - 1 дитина': 200,
            'Термомозаїка - 1 дитина': 200,
            'Бомбочки для ванни - 1 дитина': 200,
            'Шиммер коктейлі - 1 дитина': 200,
            'Льодяники з ізомальту - 1 дитина': 200,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 250,
            'Мило - 1 дитина': 250,
            'Пряники - 1 дитина': 300,
            'BEARBRICK - 1 дитина': 500,
            'Твістінг до 10 дітей': 500,
            'Твістінг до 20 дітей': 800,
            'Морозиво до 10 дітей': 2000,
            'Морозиво до 20 дітей': 3000,
            'Солодка вата до 10 дітей': 2000,
            'Солодка вата до 20 дітей': 3000
        },
        '🎨 Декор': {
            'Базовий декор': 4000
        },
        '🎈 Пін\'ят': {
            'Стандартна': 900,
            'Велика': 1100
        },
        '🎁 Єкспрес привітання':{
            '1 аніматор 20 хвилин': 1000,
            '2 аніматори 20 хвилин': 1200
        }
    }
}

# Прості додаткові послуги (одна кнопка - одне додавання)
ADDITIONAL_SERVICES_SINGLE = {
    'Київ': {
        '🎵 Діджей 1 г': 4000,
        '🎥 Відеограф 1 г': 3000,
        '📸 Фотограф 1 г': 2500,
        '🎤 Ведучий 1 г': 4000,
        '🐻 Білий ведмедик': 1500,
        '🫧 Генератор мильних бульбашок': 1000,

    },
    'Кривий Ріг': {
        '🫧 Генератор мильних бульбашок':800,
        '🎵 Діджей 1 г': 2000,
        '🎥 Відеограф 1 г': 2500,
        '📸 Фотограф 1 г': 1800,
        '🎤 Ведучий 1 г': 1500
    }
}


# Вартість таксі для різних районів (туди/назад)
TAXI_PRICES = {
    'Київ': {
        'Деснянський район': 600,
        'Дніпровський район': 600,
        'Солом\'янський район': 500,
        'Шевченківський район': 500,
        'Голосіївський район': 600,
        'Печерський район': 500,
        'Подільський район': 500,
        'Святошинський район': 700,
        'Дарницький район': 700,
        'Оболонський район': 600,
        'Інше': "По тарифу перевізника"  # Для інших районів
    },
    'Кривий Ріг': {
        'Довгинцівський район': 200,
        'Інгулецький район': 270,
        'Металургійний район': 150,
        'Покровський район': 270,
        'Саксаганський район': 220,
        'Тернівський район': 330,
        'Центрально-Міський район': 270,
        'Інше': "По тарифу перевізника"  # Для інших районів
    }
}
