import os
import logging
from dotenv import load_dotenv

# Налаштування логування
logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)
logger = logging.getLogger(__name__)

# Завантаження змінних середовища
load_dotenv()

# Telegram конфігурація
TELEGRAM_BOT_TOKEN = os.getenv('TELEGRAM_BOT_TOKEN')

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")

MANAGER_ERROR="Нажаль сталась помилка при надсиланні повідомлення, спробуйте зв'язатись з одним з наших менеджерів по посиланню @confetti_manager або @confettimanager"

#Привітання з користувачем
Hello_World = "🎉 Вас вітає Bot CONFETTI - найкращий помічник в створенні яскравих свят та вражаючих подій!\n\nОберіть місто, де ви хочете організувати свято:"

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']

# Типи подій
EVENT_TYPES = {
    '🎂 День народження': 'День народження',
    '📅 Афіша подій': 'Афіша подій',
    '🎓 Випускний': 'Випускний',
    '👨‍👩‍👧‍👦 Сімейне свято': 'Сімейне свято',
    '🎯 Інше': 'Інше'
}
# Список типів подій для клавіатури
EVENT_TYPES_LIST = list(EVENT_TYPES.keys())



# Ціни/Кнопки на семейні свят
FAMALY_TRIP = {
    "Київ":{
        "Ведучий 1 година": 4000,
        "Ді-джей 1 година": 4000,
        "Бебісітер 1 година": 3000
    },
    "Кривий Ріг":{
        "Ведучий 1 година": 1500,
        "Ді-джей 1 година": 2000,
        "Бебісітер 1 година": 1800
    }
}

FAMILY_INFO = (
    "Ми можемо бути з вами на будь-якому сімейному святі та зробимо все, щоб дорослі відпочивали та спілкувались, а діти проводили час весело та під наглядом.\n\n"
    "Свята, на які нас запрошують:\n"
    "- Святкування першого року життя 🎂\n"
    "- Хрестини ✝️\n"
    "- Весілля 💏\n"
    "- Ювілей та інше 🎉"
)

FAMILY_INFO_INFO2 = (
    "Щоб дізнатися більш детальну інформацію або зробити замовлення - звертайтесь до менеджера 📲"
)



# Інформація текстова в Афіша подій
CITY_CHANNELS = {
    'Київ': 'Очікуйте оновлень.',
    'Кривий Ріг': (
        "🎃 Дякуємо, що були з нами на нашій неймовірній вечірці Хелловін!\n"
        "Було страшенно весело й круто — завдяки вам 🧡\n\n"
        "👉 Фото з вечірок можна переглянути за посиланнями:\n"
        "📸 1.11.25 — посилання\n"
        "📸 2.11.25 — посилання\n\n"
        "До нових святкових зустрічей! ✨"
    )
}

#ПОСИЛАННЯ НА ФОТО/відео Афіши
FOTO_AFISHA = {
    'Київ': 'матеріали/images/Афіша/',
    'Кривий Ріг':'матеріали/images/Афіша/хелловін2.jpg'
}

#Данні ДЛЯ РЕЄСТРУВАННЯ
AFISHA_REESTR = {
    "Київ":
        "Щоб зареєструватись для участі у цій події напишіть ▪️ОДНИМ ПОВІДОМЛЕННЯМ▪️такі данні:\n\n"
        "1. Імʼя дитини 💜\n"
        "2. Дата народження дитини 🎂\n"
        "3. Ваш номер телефону та імʼя 📲\n\n"
        "💫Якщо у вас в родині більше 2/3…. діток, будь ласка, в цьому ж повідомленні залиште інформацію і про них"
    ,
    "Кривий Ріг":
        "Щоб зареєструватись для участі у цій події напишіть ▪️ОДНИМ ПОВІДОМЛЕННЯМ▪️такі данні:\n\n"
        "1. Імʼя та вік дитини\n"
        "2. Кількість дитячих та дорослих місць\n"
        "3. Ваш номер телефону та імʼя 📲\n\n"
        "💫Якщо на святі буде більше 2/3…. діток, будь ласка, в цьому ж повідомленні залиште інформацію і про них"
    
}

# Загальна інформація для розділу "Інше"
GENERAL_INFO = {
    'Київ': (
        "🌟 CONFETTI у Києві - це:\n\n"
        "🎭 Професійні аніматори\n"
        "🎨 Яскраві шоу-програми\n"
        "🔑 Організація свят під ключ\n"
        "🎁 Особливий підхід до кожного клієнта\n\n"
        "Наші послуги доступні по всьому Києву та області!"
    ),
    'Кривий Ріг': (
        "🌟 CONFETTI у Кривому Розі - це:\n\n"
        "🎭 Креативні аніматори\n"
        "🎨 Унікальні програми\n"
        "🔑 Організація свят під ключ\n"
        "🎁 Індивідуальний підхід\n\n"
        "Працюємо по всьому місту та передмістю!"
    )
}

# Контактна інформація менеджера
MANAGER_INFO = {
    'Київ': {
        'phone': '+380976036768',
        'telegram': '@confetti_manager',
        'name': 'Поліна'
    },
    'Кривий Ріг': {
        'phone': '+380968308363',
        'telegram': '@confettimanager',
        'name': 'Поліна'
    }
}

# Повідомлення для контактів менеджера
MANAGER_CONTACT_MESSAGES = {
    'Київ': (
        "👋 Вас вітає менеджер CONFETTI-bot у Києві!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n" 
        "📞 Зателефонувати: {phone}\n"
        "👤 Менеджер: {name}\n"
        "📱 Написати: {telegram}\n\n"
        "Працюємо щодня з 9:00 до 20:00"
    ),
    'Кривий Ріг': (
        "🎈 CONFETTI-bot Кривий Ріг вітає вас!\n\n"
        "Наш менеджер допоможе підібрати найкращу програму "
        "та відповість на всі ваші запитання:\n\n"  
        "👤 Менеджер: {name}\n"
        "📞 Зателефонувати: {phone}\n"
        "📱 Написати: @confetti_manager\n\n"
        "👤 Менеджер: Андрій\n"
        "📞 Зателефонувати: +380973185979\n"
        "📱 Написати: {telegram}\n\n"
        "Чекаємо на ваше звернення з 9:00 до 20:00"
    )
}

# Отримання та конвертація ID менеджера
try:
    MANAGER_CHAT_ID_KIEV = int(os.getenv('MANAGER_CHAT_ID_KIEV'))
    MANAGER_CHAT_ID_KR = int(os.getenv('MANAGER_CHAT_ID_KR'))
    logger.info(f"ID менеджера Київ успішно завантажено: {MANAGER_CHAT_ID_KIEV}")
    logger.info(f"ID менеджера Кривий Ріг успішно завантажено: {MANAGER_CHAT_ID_KR}")
except (TypeError, ValueError) as e:
    logger.error(f"Помилка при завантаженні ID менеджера: {str(e)}")
    MANAGER_CHAT_ID_KIEV = None
    MANAGER_CHAT_ID_KR = None

# Перевірка наявності необхідних змінних
if not TELEGRAM_BOT_TOKEN:
    logger.error("Не знайдено токен бота в змінних середовища")
if not MANAGER_CHAT_ID_KIEV:
    logger.error("Не знайдено ID менеджера Київ в змінних середовища")
if not MANAGER_CHAT_ID_KR:
    logger.error("Не знайдено ID менеджера Кривий Ріг в змінних середовища")

# Налаштування кнопок меню
CITIES = ['Київ', 'Кривий Ріг']





# Шляхи до PDF файлів з місцями проведення
LOCATION_PDF_FILES = {
    'Київ': 'матеріали/місця проведення/locations_київ.pdf',
    'Кривий Ріг': 'матеріали/місця проведення/locations_кривий_ріг.pdf'
}

# Локації для різних типів подій
LOCATIONS = {
    '🎂 День народження': [
        '🏠 Вдома',
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ],
    '🎓 Випускний': [
        '🍽 Ресторан/Кафе',
        '🏫 Садочок/Школа',
        '🏰 Заміський комплекс',
        '📍 Інше'
    ]
}

# Інформація про локації
LOCATION_INFO = {
    'Київ': {
        '🏠 Вдома': 'Свято вдома - це завжди затишна та рідна атмосфера, де веселяться не тількі діти, а й дорослі🤪',
        '🍽 Ресторан/Кафе': 'Свято в ресторані або кафе - це коли батьки відпочивають, а діти весело проводять час із професійними ведучими😎',
        '🏫 Садочок/Школа': 'Свято в садочку або школі — це особливий момент, коли дитина відчуває себе зіркою дня серед друзів, а радість однокласників робить враження ще яскравішими й запам’ятовується усім🤩',
        '🏰 Заміський комплекс': 'Свято за містом - це завжди багато простору для активних ігор і можливість відпочити всією родиною на свіжому повітрі та захопливо провести час🎉',
        '📍 Інше': 'Допоможемо з вибором оптимального місця'
    },
    'Кривий Ріг': {
        '🏠 Вдома': 'Свято вдома - це завжди затишна та рідна атмосфера, де веселяться не тількі діти, а й дорослі🤪',
        '🍽 Ресторан/Кафе': 'Свято в ресторані або кафе - це коли батьки відпочивають, а діти весело проводять час із професійними ведучими😎',
        '🏫 Садочок/Школа': 'Свято в садочку або школі — це особливий момент, коли дитина відчуває себе зіркою дня серед друзів, а радість однокласників робить враження ще яскравішими й запам’ятовується усім🤩',
        '🏰 Заміський комплекс': 'Свято за містом - це завжди багато простору для активних ігор і можливість відпочити всією родиною на свіжому повітрі та захопливо провести час🎉',
        '📍 Інше': 'Допоможемо з вибором оптимального місця'
    }
}

# Тематики свят
THEMES = [
    '🏰 Казкові герої',
    '🎮 Game Party',
    '🦸‍♂️ Супергерої',
    '🎉 Вечірка',
    '📞 Зв\'язатись з менеджером'
]

# Опис тематик
THEME_INFO = {
    '🏰 Казкові герої': 'Улюблені персонажі казок оживуть на вашому святі та відправляться разом з іменинником у світ магії, чарів та вражаючих подій🧙',
    
    '🎮 Game Party': 'Вечірка в стилі улюблених відеоігор! Minecraft, Roblox, Among Us та інші популярні ігри стануть частиною вашого свята🤖',
    
    '🦸‍♂️ Супергерої': 'Захоплююча зустріч з супергероями! Людина-павук, Бетмен, Чудо-жінка та інші герої завітають на ваше свято та відправляться у справжні пригоди разом з іменинником та його друзями💪🏻',

    '🎉 Вечірка': 'Яскрава вечірка з сучасними ведучими, популярними трендами, танцями та розвагами! Створимо драйвову атмосферу для неперевершеного святкування🎊'
} 

# --- Тематичні кнопки по містам ---
THEME_BTN = {
    'Київ': {
        '🏰 Казкові герої': [
            'Сонік та Емі',
            'Цифровий цирк',
            'Барбі та Кен',
            'Лісова казка',
            'Уенсдей',
            'Єдиноріжки',
            'Крижане серце',
            'Paw Patrol',
            'Міккі та Мінні',
            'Леді Баг та Супер Кіт',
            'Аліса та Капелюшник',
            'Гаррі Поттер та Герміона',
            'Ляльки Лол',
            'Принцеса Аврора та Принц Філіпп',
            'Малефісента',
            'Літл Поні',
            'Феї Winx',
            'Герої в масках',
            'Лалафанфан',
            'Білий ведмедик',
            'Зоотрополіс',
            'Тролі',
            'Три коти',
            'Тачки',
            'Моана та Мауї',
            'Пеппа та Джордж',
            'Сofія Прекрасна',
            'Котяча вечірка',
            'Рапунцель',
            'Посіпаки',
            'Маша і Ведмідь',
            'Фіксики',
            'Монстри на канікулах',
            'Лего Ніндзяго',
            'Русалонька та Коник',
        ],
        '🎮 Game Party': [
            'Roblox',
            'Brawl stars',
            'Minecraft',
            'Among us',
        ],
        '🦸‍♂️ Супергерої': [
            'Залізна Людина та Диво Жінка',
            'Людина Павук та Жінка Кішка',
            'Супермен та Супервумен',
            'Трансформери',
            'Бетмен',
            'Капітан Америка та Залізна Людина',
            'Черепашки Ніндзя',
        ],
        '🎉 Вечірка': [
            'Спортивна',
            'Морська',
            'Sweet Party',
            'K-Pop',   
            'Tik-tok party', 
            'Safari party', 
            'Секретна лабораторія', 
            'Перший мільйон', 
            'Pop-it party', 
            'Smile party', 
            'Космічна', 
            'Французька', 
            'Футбольна', 
            'Голівуд',
            'Гра в кальмара',
        ]
    },
    # Додайте інші міста за аналогією
    'Кривий Ріг': {
        '🏰 Казкові герої': [
            'Сонік та Емі',
            'Барбі та Кен',
            'Лісова казка',
            'Уенсдей',
            'Єдиноріжки',
            'Крижане серце',
            'Paw Patrol',
            'Міккі та Мінні',
            'Леді Баг та Супер Кіт',
            'Аліса та Капелюшник',
            'Гаррі Поттер та Герміона',
            'Ляльки Лол',
            'Принцеса Аврора та Принц Філіпп',
            'Малефісента',
            'Літл Поні',
            'Феї Winx',
            'Герої в масках',
            'Лалафанфан',
            'Білий ведмедик',
            'Зоотрополіс',
            'Тролі',
            'Три коти',
            'Тачки',
            'Моана та Мауї',
            'Пеппа та Джордж',
            'Сofія Прекрасна',
            'Котяча вечірка',
            'Рапунцель',
            'Посіпаки',
            'Маша і Ведмідь',
            'Фіксики',
            'Монстри на канікулах',
            'Лего Ніндзяго',
            'Русалонька та Коник',
        ],
        '🎮 Game Party': [
            'Roblox',
            'Brawl stars',
            'Minecraft',
            'Among us',
        ],
        '🦸‍♂️ Супергерої': [
            'Залізна Людина та Диво Жінка',
            'Людина Павук та Жінка Кішка',
            'Супермен та Супервумен',
            'Трансформери',
            'Бетмен',
            'Капітан Америка та Залізна Людина',
            'Черепашки Ніндзя',
        ],
        '🎉 Вечірка': [
            'Спортивна',
            'Морська',
            'Sweet Party',
            'K-Pop',   
            'Tik-tok party', 
            'Safari party', 
            'Секретна лабораторія', 
            'Перший мільйон', 
            'Pop-it party', 
            'Smile party', 
            'Космічна', 
            'Французька', 
            'Футбольна', 
            'Голівуд',
            'Гра в кальмара',
        ]
    }
} 

THEME_PHOTOS = {
    'Київ': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КИЇВ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КИЇВ/казкові_герої/Русалочка та коник.jpg',

            'Сонік та Емі': 'матеріали/images/КИЇВ/казкові_герої/Сонік.PNG',
            'Барбі та Кен': 'матеріали/images/КИЇВ/казкові_герої/Барбі і Кен.PNG',
            'Лісова казка': 'матеріали/images/КИЇВ/казкові_герої/Мавка і Лукаш.PNG',
            'Уенсдей': 'матеріали/images/КИЇВ/казкові_герої/венсдей.PNG',
            'Єдиноріжки': 'матеріали/images/КИЇВ/казкові_герої/Єдиноріжки.PNG',
            'Крижане серце': 'матеріали/images/КИЇВ/казкові_герої/Крижане серце.PNG',
            'Paw Patrol': 'матеріали/images/КИЇВ/казкові_герої/Paw Patrol.jpg',
            'Міккі та Мінні': 'матеріали/images/КИЇВ/казкові_герої/Міккі та Мінні.PNG',
            'Леді Баг та Супер Кіт': 'матеріали/images/КИЇВ/казкові_герої/Леді Баг.PNG',
            'Аліса та Капелюшник': 'матеріали/images/КИЇВ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КИЇВ/казкові_герої/Гаррі Поттер та Герміона.PNG',
            'Ляльки Лол': 'матеріали/images/КИЇВ/казкові_герої/Лол.PNG',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КИЇВ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КИЇВ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КИЇВ/казкові_герої/Літл Поні.PNG',
            'Феї Winx': 'матеріали/images/КИЇВ/казкові_герої/Феї.jpg',
            'Герої в масках': 'матеріали/images/КИЇВ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КИЇВ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КИЇВ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КИЇВ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КИЇВ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КИЇВ/казкові_герої/Три коти.PNG',
            'Тачки': 'матеріали/images/КИЇВ/казкові_герої/Тачки.PNG',
            'Моана та Мауї': 'матеріали/images/КИЇВ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КИЇВ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КИЇВ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КИЇВ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КИЇВ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КИЇВ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КИЇВ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КИЇВ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КИЇВ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КИЇВ/казкові_герої/Лего Ніндзяго.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КИЇВ/game_party/Roblox.PNG',
            'Brawl stars': 'матеріали/images/КИЇВ/game_party/Brawl stars.PNG',
            'Minecraft': 'матеріали/images/КИЇВ/game_party/Minecraft.PNG',
            'Among us': 'матеріали/images/КИЇВ/game_party/Among us.PNG',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КИЇВ/супергерої/Залізна Людина та Диво Жінка.jpg',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КИЇВ/супергерої/Людина Павук та Жінка Кішка.jpg',
            'Супермен та Супервумен': 'матеріали/images/КИЇВ/супергерої/Супермен та Супервумен.jpg',
            'Трансформери': 'матеріали/images/КИЇВ/супергерої/Трансформери.PNG',
            'Бетмен': 'матеріали/images/КИЇВ/супергерої/Бетмен.jpg',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КИЇВ/супергерої/Капітан Америка та Залізна Людина.jpg',
            'Черепашки Ніндзя': 'матеріали/images/КИЇВ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КИЇВ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КИЇВ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КИЇВ/вечірка/Sweet Party.PNG',
            'K-Pop': 'матеріали/images/КИЇВ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КИЇВ/вечірка/Tik-tok party.PNG',
            'Safari party': 'матеріали/images/КИЇВ/вечірка/Safari party.PNG',
            'Секретна лабораторія': 'матеріали/images/КИЇВ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КИЇВ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КИЇВ/вечірка/Pop-it party.PNG',
            'Smile party': 'матеріали/images/КИЇВ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КИЇВ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КИЇВ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КИЇВ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КИЇВ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КИЇВ/вечірка/Гра в кальмара.jpg',
        }
    },
    'Кривий Ріг': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
            'Сонік та Емі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сонік та Емі.PNG',
            'Барбі та Кен': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Барбі та Кен.PNG',
            'Лісова казка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лісова казка.PNG',
            'Уенсдей': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/венсдей.PNG',
            'Єдиноріжки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Єдиноріжки.PNG',
            'Крижане серце': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Крижане серце.PNG',
            'Paw Patrol': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Paw Patrol.PNG',
            'Міккі та Мінні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Міккі та Мінні.PNG',
            'Леді Баг та Супер Кіт': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Леді Баг та Супер Кіт.PNG',
            'Аліса та Капелюшник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Гаррі Поттер та Герміона.PNG',
            'Ляльки Лол': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Ляльки Лол.PNG',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Літл Поні.PNG',
            'Феї Winx': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Феї Winx.jpg',
            'Герої в масках': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Три коти.PNG',
            'Тачки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тачки.PNG',
            'Моана та Мауї': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лего Ніндзяго.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КРИВИЙ РІГ/game_party/Roblox.PNG',
            'Brawl stars': 'матеріали/images/КРИВИЙ РІГ/game_party/Brawl stars.PNG',
            'Minecraft': 'матеріали/images/КРИВИЙ РІГ/game_party/Minecraft.PNG',
            'Among us': 'матеріали/images/КРИВИЙ РІГ/game_party/Among us.PNG',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Залізна Людина та Диво Жінка.jpg',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Людина Павук та Жінка Кішка.jpg',
            'Супермен та Супервумен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супермен та Супервумен.jpg',
            'Трансформери': 'матеріали/images/КРИВИЙ РІГ/супергерої/Трансформери.PNG',
            'Бетмен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Бетмен.jpg',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КРИВИЙ РІГ/супергерої/Капітан Америка та Залізна Людина.jpg',
            'Черепашки Ніндзя': 'матеріали/images/КРИВИЙ РІГ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КРИВИЙ РІГ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Sweet Party.PNG',
            'K-Pop': 'матеріали/images/КРИВИЙ РІГ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Tik-tok party.PNG',
            'Safari party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Safari party.PNG',
            'Секретна лабораторія': 'матеріали/images/КРИВИЙ РІГ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КРИВИЙ РІГ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Pop-it party.PNG',
            'Smile party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КРИВИЙ РІГ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КРИВИЙ РІГ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КРИВИЙ РІГ/вечірка/Гра в кальмара.jpg',
        }
    }
}


THEME_PHOTOS_VIPUSK = {
    'Київ': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КИЇВ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КИЇВ/казкові_герої/Русалочка та коник.jpg',

            'Сонік та Емі': 'матеріали/images/КИЇВ/казкові_герої/Сонік.jpg',
            'Барбі та Кен': 'матеріали/images/КИЇВ/казкові_герої/Барбі і Кен.jpg',
            'Лісова казка': 'матеріали/images/КИЇВ/казкові_герої/Мавка і Лукаш.jpg',
            'Уенсдей': 'матеріали/images/КИЇВ/казкові_герої/венсдей.jpg',
            'Єдиноріжки': 'матеріали/images/КИЇВ/казкові_герої/Єдиноріжки.jpg',
            'Крижане серце': 'матеріали/images/КИЇВ/казкові_герої/Крижане серце.jpg',
            'Paw Patrol': 'матеріали/images/КИЇВ/казкові_герої/Paw Patrol.jpg',
            'Міккі та Мінні': 'матеріали/images/КИЇВ/казкові_герої/Міккі та Мінні.jpg',
            'Леді Баг та Супер Кіт': 'матеріали/images/КИЇВ/казкові_герої/Леді Баг.jpg',
            'Аліса та Капелюшник': 'матеріали/images/КИЇВ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КИЇВ/казкові_герої/Гаррі Поттер та Герміона.jpg',
            'Ляльки Лол': 'матеріали/images/КИЇВ/казкові_герої/Лол.jpg',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КИЇВ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КИЇВ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КИЇВ/казкові_герої/Літл Поні.jpg',
            'Феї Winx': 'матеріали/images/КИЇВ/казкові_герої/Феї.jpg',
            'Герої в масках': 'матеріали/images/КИЇВ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КИЇВ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КИЇВ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КИЇВ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КИЇВ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КИЇВ/казкові_герої/Три коти.jpg',
            'Тачки': 'матеріали/images/КИЇВ/казкові_герої/Тачки.jpg',
            'Моана та Мауї': 'матеріали/images/КИЇВ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КИЇВ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КИЇВ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КИЇВ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КИЇВ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КИЇВ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КИЇВ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КИЇВ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КИЇВ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КИЇВ/казкові_герої/Лего Ніндзяго.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КИЇВ/game_party/Roblox.jpg',
            'Brawl stars': 'матеріали/images/КИЇВ/game_party/Brawl stars.jpg',
            'Minecraft': 'матеріали/images/КИЇВ/game_party/Minecraft.jpg',
            'Among us': 'матеріали/images/КИЇВ/game_party/Among us.jpg',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КИЇВ/супергерої/Залізна Людина та Диво Жінка.jpg',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КИЇВ/супергерої/Людина Павук та Жінка Кішка.jpg',
            'Супермен та Супервумен': 'матеріали/images/КИЇВ/супергерої/Супермен та Супервумен.jpg',
            'Трансформери': 'матеріали/images/КИЇВ/супергерої/Трансформери.jpg',
            'Бетмен': 'матеріали/images/КИЇВ/супергерої/Бетмен.jpg',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КИЇВ/супергерої/Капітан Америка та Залізна Людина.jpg',
            'Черепашки Ніндзя': 'матеріали/images/КИЇВ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КИЇВ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КИЇВ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КИЇВ/вечірка/Sweet Party.jpg',
            'K-Pop': 'матеріали/images/КИЇВ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КИЇВ/вечірка/Tik-tok party.jpg',
            'Safari party': 'матеріали/images/КИЇВ/вечірка/Safari party.jpg',
            'Секретна лабораторія': 'матеріали/images/КИЇВ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КИЇВ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КИЇВ/вечірка/Pop-it party.jpg',
            'Smile party': 'матеріали/images/КИЇВ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КИЇВ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КИЇВ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КИЇВ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КИЇВ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КИЇВ/вечірка/Гра в кальмара.jpg',
        }
    },
    'Кривий Ріг': {
        '🏰 Казкові герої': {
            'Цифровий цирк': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Цифровий цирк.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
            'Сонік та Емі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сонік та Емі.jpg',
            'Барбі та Кен': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Барбі та Кен.jpg',
            'Лісова казка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лісова казка.jpg',
            'Уенсдей': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/венсдей.jpg',
            'Єдиноріжки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Єдиноріжки.jpg',
            'Крижане серце': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Крижане серце.jpg',
            'Paw Patrol': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Paw Patrol.jpg',
            'Міккі та Мінні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Міккі та Мінні.jpg',
            'Леді Баг та Супер Кіт': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Леді Баг та Супер Кіт.jpg',
            'Аліса та Капелюшник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Аліса та Капелюшник.jpg',
            'Гаррі Поттер та Герміона': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Гаррі Поттер та Герміона.jpg',
            'Ляльки Лол': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Ляльки Лол.jpg',
            'Принцеса Аврора та Принц Філіпп': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Принцеса Аврора та Принц Філіпп.jpg',
            'Малефісента': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Малефісента.jpg',
            'Літл Поні': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Літл Поні.jpg',
            'Феї Winx': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Феї Winx.jpg',
            'Герої в масках': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Герої в масках.jpg',
            'Лалафанфан': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лалафанфан.jpg',
            'Білий ведмедик': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Білий ведмедик.jpg',
            'Зоотрополіс': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Зоотрополіс.jpg',
            'Тролі': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тролі.jpg',
            'Три коти': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Три коти.jpg',
            'Тачки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Тачки.jpg',
            'Моана та Мауї': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Моана та Мауї.jpg',
            'Пеппа та Джордж': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Пеппа та Джордж.jpg',
            'Сofія Прекрасна': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Сofія Прекрасна.jpg',
            'Котяча вечірка': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Котяча вечірка.jpg',
            'Рапунцель': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Рапунцель.jpg',
            'Посіпаки': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Посіпаки.jpg',
            'Маша і Ведмідь': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Маша і Ведмідь.jpg',
            'Фіксики': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Фіксики.jpg',
            'Монстри на канікулах': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Монстри на канікулах.jpg',
            'Лего Ніндзяго': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Лего Ніндзяго.jpg',
            'Русалонька та Коник': 'матеріали/images/КРИВИЙ РІГ/казкові_герої/Русалонька та Коник.jpg',
        },
        '🎮 Game Party': {
            'Roblox': 'матеріали/images/КРИВИЙ РІГ/game_party/Roblox.jpg',
            'Brawl stars': 'матеріали/images/КРИВИЙ РІГ/game_party/Brawl stars.jpg',
            'Minecraft': 'матеріали/images/КРИВИЙ РІГ/game_party/Minecraft.jpg',
            'Among us': 'матеріали/images/КРИВИЙ РІГ/game_party/Among us.jpg',
        },
        '🦸‍♂️ Супергерої': {
            'Залізна Людина та Диво Жінка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Залізна Людина та Диво Жінка.jpg',
            'Людина Павук та Жінка Кішка': 'матеріали/images/КРИВИЙ РІГ/супергерої/Людина Павук та Жінка Кішка.jpg',
            'Супермен та Супервумен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Супермен та Супервумен.jpg',
            'Трансформери': 'матеріали/images/КРИВИЙ РІГ/супергерої/Трансформери.jpg',
            'Бетмен': 'матеріали/images/КРИВИЙ РІГ/супергерої/Бетмен.jpg',
            'Капітан Америка та Залізна Людина': 'матеріали/images/КРИВИЙ РІГ/супергерої/Капітан Америка та Залізна Людина.jpg',
            'Черепашки Ніндзя': 'матеріали/images/КРИВИЙ РІГ/супергерої/Черепашки Ніндзя.jpg',
        },
        '🎉 Вечірка': {
            'Спортивна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Спортивна.jpg',
            'Морська': 'матеріали/images/КРИВИЙ РІГ/вечірка/Морська.jpg',
            'Sweet Party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Sweet Party.jpg',
            'K-Pop': 'матеріали/images/КРИВИЙ РІГ/вечірка/K-Pop.jpg',
            'Tik-tok party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Tik-tok party.jpg',
            'Safari party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Safari party.jpg',
            'Секретна лабораторія': 'матеріали/images/КРИВИЙ РІГ/вечірка/Секретна лабораторія.jpg',
            'Перший мільйон': 'матеріали/images/КРИВИЙ РІГ/вечірка/Перший мільйон.jpg',
            'Pop-it party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Pop-it party.jpg',
            'Smile party': 'матеріали/images/КРИВИЙ РІГ/вечірка/Smile party.jpg',
            'Космічна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Космічна.jpg',
            'Французька': 'матеріали/images/КРИВИЙ РІГ/вечірка/Французька.jpg',
            'Футбольна': 'матеріали/images/КРИВИЙ РІГ/вечірка/Футбольна.jpg',
            'Голівуд': 'матеріали/images/КРИВИЙ РІГ/вечірка/Голівуд.jpg',
            'Гра в кальмара': 'матеріали/images/КРИВИЙ РІГ/вечірка/Гра в кальмара.jpg',
        }
    }
}

# Формати свята
EVENT_FORMATS = {
    '⏰ Погодинно': 'Погодинна оплата',
    '📦 Пакетні пропозиції': 'Пакетні пропозиції',
    '🎯 Квести': 'Квести'
} 

# Конфігурація погодинних цін
HOURLY_PRICES = {
    'Київ': {
        '🎂 День народження': {
            'Експрес привітання (1 аніматор)-20 хвилин': 3000,
            'Експрес привітання (2 аніматори)-20 хвилин': 3500,
            '1 аніматор 1 година': 3500,
            '2 аніматори 1 година': 4500,
            '2 аніматори (ростові) 1 година': 4500,
            '3 аніматори 1 година': 6000
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 4500
        },
        '🎂 День народження (турбаза)': {
            '2 аніматори 1 година': 4500
        },
        '🎓 Випускний (турбаза)': {
            '2 аніматори 1 година': 4500
        }
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            '2 аніматори 1 година': 1800,
            '2 аніматори 2 години': 1800*2,
            '2 аніматори 3 години': 1800*3,
            '2 аніматори 4 години': 1800*4
        },
        '🎓 Випускний': {
            'Базова ціна 1 година': 2200
        },
        '🎂 День народження (турбаза)': {
            '2 аніматори 1 година': 1800
        },
        '🎓 Випускний (турбаза)': {
            '2 аніматори 1 година': 2200
        }
    }
}  

PAKET_PRICES = {
    'Київ': {
        '🎂 День народження': {
            'Лайтовий 1.5 годин': 5800,
            'Magic 1.5 годин': 6800,
            'Frosty 1.5 годин': 7800,
            'Основний 2 години': 6900,
            'Magic 2 години': 7900,
            'Frosty 2 години': 8900,
            'Комплексний 3 години': 9500,
            'Топовий 3 години': 12000,
            'Квестовий 3 години': 13500,
            'Fun 2 години (підлітковий)': 8000,
            'Quest 2 години (підлітковий)': 10000,
            'Pop-dance 3 години (підлітковий)': 11000
        },
        '🎓 Випускний': {
            'Розважальний (1.5 год)': 7500,
            'Вражаючий (2 год)': 8700,
            'Кольоровий (2 год)': 9700,
            'Драйвовий (2.5 год)': 11000  
        }   
    },
    'Кривий Ріг': {
        '🎂 День народження': {
            'Святковий 1.5 години': 2900,
            'Magic 1.5 годин': 2900,
            'Frosty 1.5 годин': 3500,
            'Quest 2 години': 4000,
            'Особливий 2 години': 3900,
            'Творчий 3 години': 5500,
            'Fun 2 години (підлітковий)': 4000,
            'Quest 2 години (підлітковий)': 4500,
            'Pop-dance 3 години (підлітковий)': 5500
        },
        '🎓 Випускний': {
            'Study 1.5 годин': 3400,
            'Color 1.5 годин': 4000,
            'WoW 1.5 годин': 4500  
        }     
    }
}

# Посилання на фото для пакетів
PAKET_PHOTOS = {
    'Київ': {
    '🎂 День народження': {
        'Лайтовий 1.5 годин': 'матеріали/images/КИЇВ/Пакети/1. Лайтовий 1,5.jpg',
        'Magic 1.5 годин': 'матеріали/images/КИЇВ/Пакети/2. Меджик 1,5.jpg',
        'Frosty 1.5 годин': 'матеріали/images/КИЇВ/Пакети/3. Фрості 1,5.jpg',
        'Основний 2 години': 'матеріали/images/КИЇВ/Пакети/4. Основний 2.jpg',
        'Magic 2 години': 'матеріали/images/КИЇВ/Пакети/5. Меджик 2.jpg',
        'Квестовий 3 години': 'матеріали/images/КИЇВ/Пакети/9. Квестовий 3.jpg',
        'Frosty 2 години': 'матеріали/images/КИЇВ/Пакети/6. Фрості 2.jpg',
        'Комплексний 3 години': 'матеріали/images/КИЇВ/Пакети/7. Комплексний 3.jpg',
        'Топовий 3 години': 'матеріали/images/КИЇВ/Пакети/8. Топовий 3.jpg',
        
        'Fun 2 години (підлітковий)': 'матеріали/images/КИЇВ/Пакети/fun.PNG',
        'Pop-dance 3 години (підлітковий)': 'матеріали/images/КИЇВ/Пакети/pop.PNG',
        'Quest 2 години (підлітковий)': 'матеріали/images/КИЇВ/Пакети/quest.PNG'
    },
    '🎓 Випускний': {
        'Розважальний (1.5 год)': 'матеріали/images/КИЇВ/Пакети/Розважальний.PNG',
        'Вражаючий (2 год)': 'матеріали/images/КИЇВ/Пакети/вражаючий.PNG',
        'Кольоровий (2 год)': 'матеріали/images/КИЇВ/Пакети/кольоровий.PNG',
        'Драйвовий (2.5 год)': 'матеріали/images/КИЇВ/Пакети/драйвовий.PNG'  
    }
},
'Кривий Ріг': {
    '🎂 День народження': {
        'Святковий 1.5 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Святковий.PNG',
        'Особливий 2 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Особливий.PNG',
        'Творчий 3 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/Творчий.PNG',
        'Magic 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Magic.PNG',
        'Frosty 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/frosty.PNG',
        'Quest 2 години': 'матеріали/images/КРИВИЙ РІГ/Пакети/quest.PNG',
        'Quest 2 години (підлітковий)': 'матеріали/images/КРИВИЙ РІГ/Пакети/questPidlitki.PNG',
        'Fun 2 години (підлітковий)': 'матеріали/images/КРИВИЙ РІГ/Пакети/fun.PNG',
        'Pop-dance 3 години (підлітковий)': 'матеріали/images/КРИВИЙ РІГ/Пакети/Pop.PNG'
    },
    '🎓 Випускний': {
        'Study 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Study.jpg',
        'Color 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/Color.jpg',
        'WoW 1.5 годин': 'матеріали/images/КРИВИЙ РІГ/Пакети/WOW.jpg'
    }
}
}

PAKET_OPIS = {
    'Київ': {
    '🎂 День народження': {
        'Лайтовий 1.5 годин': ' ',
        'Magic 1.5 годин': ' ',
        'Frosty 1.5 годин': ' ',
        'Основний 2 години': ' ',
        'Magic 2 години': ' ',
        'Квестовий 3 години': ' ',
        'Frosty 2 години': ' ',
        'Комплексний 3 години': ' ',
        'Топовий 3 години': ' ',
        
        'Fun 2 години (підлітковий)': 'Сучасні челенджі, фанові завдання та веселі виклики для усіх гостей😜',
        'Pop-dance 3 години (підлітковий)': 'Для справжніх любителів сцени, танців та перемог у справжніх батлах🔥',
        'Quest 2 години (підлітковий)': 'Для любителів складних завдань та пошуків, які завжди приводять до скарбу🔑'
    },
    '🎓 Випускний': {
        'Розважальний (1.5 год)': '',
        'Вражаючий (2 год)': ' ',
        'Кольоровий (2 год)': ' ',
        'Драйвовий (2.5 год)': ' '  
    }
},
'Кривий Ріг': {
    '🎂 День народження': {
        'Святковий 1.5 години': 'На вас чекає море мильних бульбашок 🫧 та яскрава дискотека з кульками 🎈, яка нікого не залишить осторонь! 😍',
        'Особливий 2 години': 'Професійні аквагримисти 🎨 допоможуть кожному гостю перетворитись на улюбленого героя 🦸‍♂️, а мильні бульбашки 🫧 стануть яскравим доповненням до вашого свята! 🥳',
        'Творчий 3 години': 'Три години творчості ✂️, які вміщають в себе активності з улюбленими героями 🦸‍♀️, майстер-клас на вибір 🎭, аквагрим для усіх діток 🎨, генератор мильних бульбашок 🫧! А щоб весело завершити свято, ми влаштуємо вже відому вам дискотеку разом з усіма гостями! 🎉',
        'Magic 1.5 годин': 'Будь-який герой, обраний для іменинника, стане провідником у світ магії ✨ та чарів, адже фокуси від Конфетті – вражають кожного! 🪄 І звісно, доповнить свято – яскрава 🪩 дискотека!',
        'Frosty 1.5 годин': 'Активно-розважальна програма з елементами науково-хімічного шоу 🧪, де кожний та кожна спробує зробити справжній вулкан 🌋, лавову лампу 💡, приборкати вогонь 🔥, виростити власного дракона 🐉 та створити димову завісу з холоду! ❄️ А завершити такий бум емоцій ми пропонуємо, вже відомою вам, популярною дискотекою! 🤩',
        'Quest 2 години': 'Квест-пакет для тих, хто любить вирішувати складні завдання 🕵️‍♂️, шукати відповіді та отримувати бажані скарби! 🗝️🧐',
        'Quest 2 години (підлітковий)': 'Квест-пакет для тих, хто любить вирішувати складні завдання 🕵️‍♀️, шукати відповіді та отримувати бажані скарби! 🗝️ А в кінці, на іменинника чекає піньята 🎊 та солодощі для усіх гостей 🍭',
        'Fun 2 години (підлітковий)': 'Сучасні челенджі 💥, фанові завдання 🎲 та веселі виклики для усіх гостей! 😜',
        'Pop-dance 3 години (підлітковий)': 'Для справжніх любителів сцени 🎤, танців 💃🕺 та перемог у справжніх батлах! 🔥🏆'
    },
    '🎓 Випускний': {
        'Study 1.5 годин': ' ',
        'Color 1.5 годин': ' ',
        'WoW 1.5 годин': ' '
    }
}
}

QWEST = {
    'Київ': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'НАВКОЛО СВІТУ (6+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 7500,
            '2 години': 9000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 8500,
            '2 години': 10000
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 8500,
            '2 години': 10000
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 8500,
            '2 години': 10000
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 9500,
            '2 години': 10500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 9500,
            '2 години': 10500
        },
        'КВЕСТ ПАТІ (10+ років)': {
            '1,5 години': 11000,
            '2 години': 14000
        }
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'НАВКОЛО СВІТУ (6+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДЕТЕКТИВНИЙ (8+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'PLAYDAY (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'GIRLS TIME (5+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ДІДЖИТАЛ (10+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'ВЕНСДЕЙ (7+ років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'МОРСЬКИЙ (5-7 років)': {
            '1,5 години': 3000,
            '2 години': 4000
        },
        'В СВІТІ ДІСНЕЙ (5+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ГАРРІ ПОТТЕР (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'КРИЖАНЕ СЕРЦЕ (6+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        },
        'ЕЛІКСИР ЩАСТЯ (10+ років)': {
            '1,5 години': 3500,
            '2 години': 4500
        }
    }
}

#фото для квестів
QWEST_PHOTOS = {
    'Київ': {
        'САФАРІ (5-7 років)': 'матеріали/images/КИЇВ/квести/САФАРІ.JPG',
        'НАВКОЛО СВІТУ (6+ років)': 'матеріали/images/КИЇВ/квести/НАВКОЛО СВІТУ.JPG',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'матеріали/images/КИЇВ/квести/СУПЕРГЕРОЙСЬКИЙ.JPEG',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'матеріали/images/КИЇВ/квести/ЩЕНЯЧИЙ ПАТРУЛЬ.JPG',
        'ДЕТЕКТИВНИЙ (8+ років)': 'матеріали/images/КИЇВ/квести/ДЕТЕКТИВНИЙ.JPG',
        'PLAYDAY (7+ років)': 'матеріали/images/КИЇВ/квести/PLAYDAY.PNG',
        'GIRLS TIME (5+ років)': 'матеріали/images/КИЇВ/квести/GIRLS TIME.JPG',

        'В СВІТІ ДІСНЕЙ (5+ років)': 'матеріали/images/КИЇВ/квести/В СВІТІ ДІСНЕЙ.jpeg',
        'ВЕНСДЕЙ (7+ років)': 'матеріали/images/КИЇВ/квести/ВЕНСДЕЙ.JPG',
        'ГАРРІ ПОТТЕР (7+ років)': 'матеріали/images/КИЇВ/квести/ГАРРІ ПОТТЕР.JPEG',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': 'матеріали/images/КИЇВ/квести/КРИЖАНЕ СЕРЦЕ.jpg',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'матеріали/images/КИЇВ/квести/СЕКРЕТНА ЛАБОРАТОРІЯ.JPEG',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': 'матеріали/images/КИЇВ/квести/ЕЛІКСИР ЩАСТЯ.jpg',
        'КВЕСТ ПАТІ (10+ років)': 'матеріали/images/КИЇВ/квести/КВЕСТ ПАТІ.JPG'
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/САФАРІ.JPG',
        'НАВКОЛО СВІТУ (6+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/НАВКОЛО СВІТУ.JPG',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/СУПЕРГЕРОЙСЬКИЙ.JPEG',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/ЩЕНЯЧИЙ ПАТРУЛЬ.JPG',
        'ДЕТЕКТИВНИЙ (8+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ДЕТЕКТИВНИЙ.JPG',
        'PLAYDAY (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/PLAYDAY.PNG',
        'GIRLS TIME (5+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/GIRLS TIME.JPG',
        
        'ДІДЖИТАЛ (10+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ДІДЖИТАЛ.JPG',
        'ВЕНСДЕЙ (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ВЕНСДЕЙ.JPG',
        'МОРСЬКИЙ (5-7 років)': 'матеріали/images/КРИВИЙ РІГ/квести/МОРСЬКИЙ.jpg',
        'В СВІТІ ДІСНЕЙ (5+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/В СВІТІ ДІСНЕЙ.jpeg',
        'ГАРРІ ПОТТЕР (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ГАРРІ ПОТТЕР.JPEG',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/КРИЖАНЕ СЕРЦЕ.jpg',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/СЕКРЕТНА ЛАБОРАТОРІЯ.JPEG',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': 'матеріали/images/КРИВИЙ РІГ/квести/ЕЛІКСИР ЩАСТЯ.jpg'
    }
}

QWEST_OPIS = {
    'Київ': {
        'САФАРІ (5-7 років)': '🌴🦁 ' + 'Команда дослідників має розгадати підказки одну за одною, віднайти континенти, на яких живуть тварини, щоб правильно їх поселити та повернути у домівки🌴' + ' 🦓🐘',
        'НАВКОЛО СВІТУ (6+ років)': '🌍✈️ ' + 'Нашим мандрівникам необхідно розгадати загадки та дослідити найвідоміші памʼятки світу. Кожна розгадана загадка наблизить їх до збору шифру, зібравши який, вони переможуть🌍' + ' 🗺️🏆',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': '🦸‍♂️💥 ' + 'Світовим рятівникам необхідно повернути супергероїв та їх емблеми на місця, щоб перемогти Таноса. Для цього їм доведеться перевірити свою логіку та вирішити складні загадки🦸‍♂️' + ' 🦹‍♂️🧩',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': '🐶🚓 ' + 'Нашим помічникам необхідно вирішити захоплюючі ребуси та головоломки, щоб допомогти жителям Бухти Пригод, адже щенофон тепер опинився в руках найсміливішої команди🐾' + ' 🐾🦴',
        'ДЕТЕКТИВНИЙ (8+ років)': '🕵️‍♂️🔍 ' + 'Новим детективам потрібно розкрити злочин. 3 церемонії нагородження вкрадено Оскар. Потрібно зібрати докази, шукати підказки та спілкуватись з свідками, щоб розкрити цю заплутану історію🕵️‍♂️' + ' 🏆🗝️',
        'PLAYDAY (7+ років)': '🎮🕹️ ' + 'Досвідчені гравці мають допомогти повернутись персонажам з популярних ігор назад в їх світи. Для цього потрібно відшукати кому яка тінь належить, розібрати складні цифрові шифри та відновити порядок гри🎮' + ' 🧩👾',
        'GIRLS TIME (5+ років)': '💄👑 ' + 'Дітям необхідно повернути втрачені прикраси та косметику. Доведеться виконати бюті-завдання, знайти прихованні татуювання, блискітки і розгадати ребуси повʼязані з косметикою💄' + ' 💍✨',
        'В СВІТІ ДІСНЕЙ (5+ років)': '🧚‍♀️🏰 ' + 'Місія дітей - знайти кожного загубленого персонажа Дісней та повернути його в мультфільм. Щоб це зробити потрібно буде зібрати пазл та персонажів, в цьому Вам допоможуть підказки про кожного героя' + ' 🧩🐭',
        'ВЕНСДЕЙ (7+ років)': '📚🕷️ ' + 'Новим студентам школи необхідно розгадати таємницю бібліотеки Невермору. Треба знайти книгу та відкрити замок. Шукайте ключі, підказки сховані між сторінками та досліджуйте кожен куточок🕷️' + ' 🔑📖',
        'ГАРРІ ПОТТЕР (7+ років)': '🧙‍♂️🦉 ' + 'Найкращим чарівникам необхідно розгадати послання від Дамблдора і знайти закляття, яке відчинить замки до таємної скрині. Виконуйте завдання від професорів та отримаєте магічне золото🧙' + ' 🪄⚡',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': '❄️👸 ' + 'Місія дітей - відшукати втрачені сили холоду Ельзи. Щоб повернути чари потрібно знайти підказки, розкрити таємниці та навчитись самим м заморожувати все навколо❄️' + ' ⛄️🌨️',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': '🧪🔬 ' + 'Юним хімікам потрібно по чернеткам та останнім інгрідієнтам після професора Чудакова знову створити "Препарат Щастя", адже без нього люди в світі не зможуть радіти🧪' + ' 🧫🧬',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': '🧪🔑 ' + 'Нашій команді необхідно розкрити всі таємниці та зібрати монети, які можна обміняти на інгредієнти "Еліксиру щастя". Для цього потрібно підправитись в подорож, повну загадок🔑' + ' 🪙🧉',
        'КВЕСТ ПАТІ (10+ років)': '🎉🕺 ' + 'Квест із унікальними локаціями та крутими фішками. Детально можна дізнатись у менеджера🤵' + ' 🎈🎊'
    },
    'Кривий Ріг': {
        'САФАРІ (5-7 років)': '🌴🦁 ' + 'Команда дослідників має розгадати підказки одну за одною, віднайти континенти, на яких живуть тварини, щоб правильно їх поселити та повернути у домівки🌴' + ' 🦓🐘',
        'НАВКОЛО СВІТУ (6+ років)': '🌍✈️ ' + 'Нашим мандрівникам необхідно розгадати загадки та дослідити найвідоміші памʼятки світу. Кожна розгадана загадка наблизить їх до збору шифру, зібравши який, вони переможуть🌍' + ' 🗺️🏆',
        'СУПЕРГЕРОЙСЬКИЙ (5-7 років)': '🦸‍♂️💥 ' + 'Світовим рятівникам необхідно повернути супергероїв та їх емблеми на місця, щоб перемогти Таноса. Для цього їм доведеться перевірити свою логіку та вирішити складні загадки🦸‍♂️' + ' 🦹‍♂️🧩',
        'ЩЕНЯЧИЙ ПАТРУЛЬ (5-7 років)': '🐶🚓 ' + 'Нашим помічникам необхідно вирішити захоплюючі ребуси та головоломки, щоб допомогти жителям Бухти Пригод, адже щенофон тепер опинився в руках найсміливішої команди🐾' + ' 🐾🦴',
        'ДЕТЕКТИВНИЙ (8+ років)': '🕵️‍♂️🔍 ' + 'Новим детективам потрібно розкрити злочин. 3 церемонії нагородження вкрадено Оскар. Потрібно зібрати докази, шукати підказки та спілкуватись з свідками, щоб розкрити цю заплутану історію🕵️‍♂️' + ' 🏆🗝️',
        'PLAYDAY (7+ років)': '🎮🕹️ ' + 'Досвідчені гравці мають допомогти повернутись персонажам з популярних ігор назад в їх світи. Для цього потрібно відшукати кому яка тінь належить, розібрати складні цифрові шифри та відновити порядок гри🎮' + ' 🧩👾',
        'GIRLS TIME (5+ років)': '💄👑 ' + 'Дітям необхідно повернути втрачені прикраси та косметику. Доведеться виконати бюті-завдання, знайти прихованні татуювання, блискітки і розгадати ребуси повʼязані з косметикою💄' + ' 💍✨',
        'ДІДЖИТАЛ (10+ років)': '💻🕵️‍♂️ ' + 'Завдання дітей - розкрити баги та знайти хакера, який зламав систему. Мандруючи віртуальним світом, доведеться розгадати складні шифри та сканувати QR- коди💻' + ' 🖥️🔎',
        'ВЕНСДЕЙ (7+ років)': '📚🕷️ ' + 'Новим студентам школи необхідно розгадати таємницю бібліотеки Невермору. Треба знайти книгу та відкрити замок. Шукайте ключі, підказки сховані між сторінками та досліджуйте кожен куточок🕷️' + ' 🔑📖',
        'МОРСЬКИЙ (5-7 років)': '⚓️🐠 ' + 'Досвідченим морякам потрібно буде зібрати карту підводного світу та знайти заховані скарби. Щоб досягти успіху, доведеться вирішувати головоломки та виконувати завдання, повʼязані з підводними таємницями⚓️' + ' 🐚🦑',
        'В СВІТІ ДІСНЕЙ (5+ років)': '🧚‍♀️🏰 ' + 'Місія дітей - знайти кожного загубленого персонажа Дісней та повернути його в мультфільм. Щоб це зробити потрібно буде зібрати пазл та персонажів, в цьому Вам допоможуть підказки про кожного героя' + ' 🧩🐭',
        'ГАРРІ ПОТТЕР (7+ років)': '🧙‍♂️🦉 ' + 'Найкращим чарівникам необхідно розгадати послання від Дамблдора і знайти закляття, яке відчинить замки до таємної скрині. Виконуйте завдання від професорів та отримаєте магічне золото🧙' + ' 🪄⚡',
        'КРИЖАНЕ СЕРЦЕ (6+ років)': '❄️👸 ' + 'Місія дітей - відшукати втрачені сили холоду Ельзи. Щоб повернути чари потрібно знайти підказки, розкрити таємниці та навчитись самим м заморожувати все навколо❄️' + ' ⛄️🌨️',
        'СЕКРЕТНА ЛАБОРАТОРІЯ (7+ років)': '🧪🔬 ' + 'Юним хімікам потрібно по чернеткам та останнім інгрідієнтам після професора Чудакова знову створити "Препарат Щастя", адже без нього люди в світі не зможуть радіти🧪' + ' 🧫🧬',
        'ЕЛІКСИР ЩАСТЯ (10+ років)': '🧪🔑 ' + 'Нашій команді необхідно розкрити всі таємниці та зібрати монети, які можна обміняти на інгредієнти "Еліксиру щастя". Для цього потрібно підправитись в подорож, повну загадок🔑' + ' 🪙🧉'
    }
}

# Фотографії для додаткових послуг
ADDITIONAL_SERVICES_PHOTOS = {
    'Київ': {
        'ШОУ': {
            'ПАПЕРОВЕ ШОУ': 'матеріали/images/КИЇВ/шоу/ПАПЕРОВЕ ШОУ.jpg',
            'ШОУ ПРУЖИНИ': 'матеріали/images/КИЇВ/шоу/ШОУ ПРУЖИНИ.JPEG',
            'ТЕСЛА ШОУ': 'матеріали/images/КИЇВ/шоу/ТЕСЛА ШОУ.JPG',
            'НАУКОВЕ ШОУ(У ДЕКІЛЬКОХ ВАРІАНТАХ)': 'матеріали/images/КИЇВ/шоу/НАУКОВИЙ МІКС.JPEG',
            'CRAZY CRIO': 'матеріали/images/КИЇВ/шоу/CRAZY CRIO.jpg',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/КИЇВ/шоу/ШОУ МИЛЬНИХ БУЛЬБАШОК.JPEG',
            'ШОУ ФОКУСІВ': 'матеріали/images/КИЇВ/шоу/ШОУ ФОКУСІВ.JPG',
            'ПІННА ВЕЧІРКА': 'матеріали/images/КИЇВ/шоу/ПІННА ВЕЧІРКА.PNG',
            'СКІТЛЗ ШОУ' : 'матеріали/images/КИЇВ/шоу/СКІТЛЗ ШОУ.JPG'
        },
        'МАЙСТЕР-КЛАС': {
            'Створення амулетів': 'матеріали/images/КИЇВ/майстер_класи/Створення амулетів.JPG',
            'Слайми': 'матеріали/images/КИЇВ/майстер_класи/Слайми.PNG',
            'Термомозаїка': 'матеріали/images/КИЇВ/майстер_класи/Термомозаїка.JPG',
            'Бомбочки для ванни': 'матеріали/images/КИЇВ/майстер_класи/Бомбочки для ванни.JPG',
            'Шиммер коктейлі': 'матеріали/images/КИЇВ/майстер_класи/Шиммер коктейлі.PNG',
            'Шоколадний попіт': 'матеріали/images/КИЇВ/майстер_класи/Шоколадний попіт.PNG',
            'Свічки': 'матеріали/images/КИЇВ/майстер_класи/Свічки.PNG',
            'Мило': 'матеріали/images/КИЇВ/майстер_класи/Мило.PNG',
            'Пряники': 'матеріали/images/КИЇВ/майстер_класи/Пряники.PNG',
            'Окуляри': 'матеріали/images/КИЇВ/майстер_класи/Окуляри.jpg',
            'Солодкі букети': 'матеріали/images/КИЇВ/майстер_класи/Солодкі букети.jpg',
            'Морозиво': 'матеріали/images/КИЇВ/майстер_класи/Морозиво.PNG',
            'Солодка вата': 'матеріали/images/КИЇВ/майстер_класи/Солодка вата.PNG',
            'Bubble tea': 'матеріали/images/КИЇВ/майстер_класи/Бабл ті.jpg',
            'МАЙСТЕР': 'матеріали/images/КИЇВ/майстер_класи/МАЙСТЕР.JPG',
            'Льодяники з ізомальту': 'матеріали/images/КИЇВ/майстер_класи/Льодяники з ізомальту.JPG',
            'BEARBRICK': 'матеріали/images/КИЇВ/майстер_класи/BEARBRICK.PNG',
            'Твістінг': 'матеріали/images/КИЇВ/майстер_класи/Твістінг.JPG'
        },
        "ПІН'ЯТИ": {
            'Стандартна пін\'ята - від:': 'матеріали/images/КИЇВ/піньяти/пінята2.jpg',
            'Фігурна пін\'ята - від:': 'матеріали/images/КИЇВ/піньяти/пінята3.jpg'
        },
        'ГЕНЕРАТОР': {
            '🫧 Генератор мильних бульбашок': 'матеріали/images/КИЇВ/генератор/Бульбашки.jpg',
            '💦 Аквагрим (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/АКВАГРИМ.JPG',
            '🐻 Білий ведмедик (+дорога)': 'матеріали/images/КИЇВ/генератор/Білий ведмедик.jpg',
            '🕺 Дзеркальні люди (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Дзеркальні люди.JPEG',
            '🐦 Птахи (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Птахи.JPEG',
            '💃 Глітер тату (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/ГЛІТЕР ТАТУ.JPG',
            '🎂 Торти 1 кг': 'матеріали/images/КИЇВ/генератор/Торт.JPG',
            '💡 ДИСКО СВІТЛО': 'матеріали/images/КИЇВ/генератор/ДИСКО ШАР.JPG'
        }
    },
    'Кривий Ріг': {
        'ШОУ': {
            'ШДМ шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/ШДМ шоу.JPEG',
            'ШОУ ПРУЖИНИ': 'матеріали/images/КРИВИЙ РІГ/шоу/ШОУ ПРУЖИНИ.JPEG',
            'Паперове шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/ПАПЕРОВЕ ШОУ.jpg',
            'ШОУ ФОКУСІВ': 'матеріали/images/КРИВИЙ РІГ/шоу/ШОУ ФОКУСІВ.JPEG',
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'матеріали/images/КРИВИЙ РІГ/шоу/ШОУ МИЛЬНИХ БУЛЬБАШОК.JPEG',
            'Треш шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/ТРЕШ ШОУ.JPEG',
            'Хімічне шоу': 'матеріали/images/КРИВИЙ РІГ/шоу/CRAZY CRIO.jpg',
            'ТЕСЛА ШОУ': 'матеріали/images/КРИВИЙ РІГ/шоу/ТЕСЛА ШОУ.JPG',
            'Фабрика сюрпризів': 'матеріали/images/КРИВИЙ РІГ/шоу/Фабрика сюрпризів.JPEG',
            'Пінна вечірка': 'матеріали/images/КРИВИЙ РІГ/шоу/Пінна вечірка.PNG'
        },
        'МАЙСТЕР-КЛАС': {
            'Створення амулетів': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Створення амулетів.JPG',
            'Слайми': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Слайми.PNG',
            'Термомозаїка': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Термомозаїка.JPG',
            'Бомбочки для ванни': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Бомбочки для ванни.JPG',
            'Шиммер коктейлі': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Шиммер коктейлі.PNG',
            'Шоколадний попіт': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Шоколадний попіт.PNG',
            'Свічки': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Свічки.PNG',
            'Мило': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Мило.PNG',
            'Пряники': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Пряники.PNG',
            'Окуляри': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Окуляри.jpg',
            'Солодкі букети': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Солодкі букети.jpg',
            'Морозиво': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Морозиво.PNG',
            'Солодка вата': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Солодка вата.PNG',
            'МАЙСТЕР': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/1.png',
            'Льодяники з ізомальту': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Льодяники з ізомальту.JPG',
            'BEARBRICK': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/BEARBRICK.PNG',
            'Bubble tea': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Бабл ті.jpg',
            'Твістінг': 'матеріали/images/КРИВИЙ РІГ/майстер_класи/Твістінг.JPG'
        },
        "ПІН'ЯТИ": {
            'Стандартна пін\'ята - від: ': 'матеріали/images/КРИВИЙ РІГ/піньяти/пінята2.jpg',
            'Велика пін\'ята - від: ': 'матеріали/images/КРИВИЙ РІГ/піньяти/пінята.JPEG'
        },

        'ГЕНЕРАТОР': {
            '🫧 Генератор мильних бульбашок': 'матеріали/images/КИЇВ/генератор/Бульбашки.jpg',
            '💦 Аквагрим (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/АКВАГРИМ.JPG',
            '🐻 Білий ведмедик (+дорога)': 'матеріали/images/КИЇВ/генератор/Білий ведмедик.jpg',
            '🕺 Дзеркальні люди (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Дзеркальні люди.JPEG',
            '🐦 Птахи (двоє) 1 година': 'матеріали/images/КИЇВ/генератор/Птахи.JPEG',
            '💃 Глітер тату (до 10 дітей)': 'матеріали/images/КИЇВ/генератор/ГЛІТЕР ТАТУ.JPG',
            '🎂 Торти 1 кг': 'матеріали/images/КИЇВ/генератор/Торт.JPG',
            '💡 ДИСКО СВІТЛО': 'матеріали/images/КИЇВ/генератор/ДИСКО ШАР.JPG'
        }
    }
}

# Додаткові послуги з підменю
ADDITIONAL_SERVICES_WITH_SUBMENU = {
    'Київ': {
        '🎭 Шоу': {
            'ПАПЕРОВЕ ШОУ': 2900,
            'ШОУ ПРУЖИНИ': 4000,
            'ТЕСЛА ШОУ': 4500,
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 6000,
            'ШОУ ФОКУСІВ': 6000,
            'НАУКОВЕ ШОУ(У ДЕКІЛЬКОХ ВАРІАНТАХ)': 4500,
            'СКІТЛЗ ШОУ' : 4500,
            #"ПІННА ВЕЧІРКА" : 0
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': 350,
            'Слайми - 1 дитина': 350,
            'Термомозаїка - 1 дитина': 350,
            'Бомбочки для ванни - 1 дитина': 450,
            'Шиммер коктейлі - 1 дитина': 250,
            'Шоколадний попіт - 1 дитина': 350,
            'Свічки - 1 дитина': 400,
            'Мило - 1 дитина': 450,
            'Пряники - 1 дитина': 450,
            'Окуляри - 1 дитина': 500,
            'Солодкі букети - 1 дитина': 650,
            'Морозиво до 10 дітей': 3500,
            'Морозиво до 20 дітей': 4500,
            'Солодка вата до 10 дітей': 3500,
            'Солодка вата до 20 дітей': 4000,
            'Bubble tea до 10 дітей': 3700,
            'Bubble tea до 20 дітей': 5000
        },
        '🎨 Декор': {
            'Базовий декор від': 7000,
            'Люкс декор від': 10000
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від:': 1500,
            'Фігурна пін\'ята - від:': 1800
        },
        '🎁 Експрес привітання':{
            '1 аніматор 20 хвилин': 3000,
            '2 аніматори 20 хвилин': 3500
        }
    },
    'Кривий Ріг': {
        '🎭 Шоу': {
            'ШДМ шоу': 2500,
            'Шоу пружини': 2500,
            'Паперове шоу': 2500,
            'Шоу фокусів': 2700,
            'Шоу мильних бульбашок': 2900,
            'Треш шоу': 3200,
            'Хімічне шоу': 3200,
            'Тесла шоу': 3500,
            'Фабрика сюрпризів': 3500,
            'Пінна вечірка': 4500
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': 150,
            'Солодкі букети - 1 дитина': 200,
            'Слайми - 1 дитина': 200,
            'Термомозаїка - 1 дитина': 200,
            'Бомбочки для ванни - 1 дитина': 200,
            'Шиммер коктейлі - 1 дитина': 200,
            'Льодяники з ізомальту - 1 дитина': 200,
            'Шоколадний попіт - 1 дитина': 250,
            'Свічки - 1 дитина': 250,
            'Мило - 1 дитина': 250,
            'Пряники - 1 дитина': 300,
            'Окуляри - 1 дитина': 350,
            'BEARBRICK - 1 дитина': 500,
            'Твістінг до 10 дітей': 500,
            'Твістінг до 20 дітей': 800,
            'Морозиво до 10 дітей': 2000,
            'Морозиво до 20 дітей': 3000,
            'Солодка вата до 10 дітей': 2000,
            'Солодка вата до 20 дітей': 3000,
            'Bubble tea до 10 дітей': 2600,
            'Bubble tea до 20 дітей': 4000
        },
        '🎨 Декор': {
            'Базовий декор від': 4000,
            'Люкс декор від': 8000
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від: ': 900,
            'Велика пін\'ята - від: ': 1100
        },
        '🎁 Експрес привітання':{
            '1 аніматор 20 хвилин': 1000,
            '2 аніматори 20 хвилин': 1200
        }
    }
}

MASTER_CLASS_EXPLANATION2={
    'Київ': {
            'МАЙСТЕР': 1000,
            },
    'Кривий Ріг': {
            'МАЙСТЕР': 800,
            }
}

OPIS_DODATKOVI={
    'Київ': {
        '🎭 Шоу': {
            'ПАПЕРОВЕ ШОУ': 'Паперове шоу 🎊 – феєричний фінал будь-якого свята! ✨ Справжній водоспад блискучих стрічок і кольорових серпантинів 🎀 створить яскраву атмосферу, даруючи круті емоції та веселощі 🪩🥳',
            'ШОУ ПРУЖИНИ': 'Унікальна Людина-Пружина 🤸‍♂️ – це саме той гість, який зробить ваше свято неповторним 😍🎉',
            'ТЕСЛА ШОУ': 'Це – унікальне шоу ⚡️, яке покаже різноманітні, захоплюючі властивості електрики ✨ та точно здивує Вас! 😲 Ця програма заряджає на неймовірні враження завдяки інтерактивним експериментам 🧪 і видовищним ефектам ⚡️🤩',
            'НАУКОВЕ ШОУ(У ДЕКІЛЬКОХ ВАРІАНТАХ)': (
                'НАУКОВЕ ШОУ (У ДЕКІЛЬКОХ ВАРІАНТАХ) 🧑‍🔬\n'
                'У цьому шоу діти відправляються у подорож по неймовірним світам Хіміїї 🧪 та Фізики ⚙️. Дві різні науки, але обидві однаково дивують та вражають 🤯. А коли експерименти проводить веселий професор Рік Санчез (так-так, той самий з мультику Рік і Морті, тільки дитяча версія) 😁, то це ще й смішно, адже на святі веселитися мають всі – навіть колби та магніти 🧲.\n'
                'У дослідах шоу задіяні: вітер 🌬️, вогонь 🔥, сухий лід ❄️, рідкий азот 🧊, блискавка ⚡️, магнітне поле 🧲, тиск, вибухові реакції 💥, крейзі винаходи 🤓, наукові лайфхаки 🧠, електро досліди ⚡️, музика 🎶, жарти 😂 та багато іншого.\n'
                'ВАРІАНТ 1. НАУКОВИЙ МІКС 🧪\n'
                '– для знайомства з науковим шоу або для невеличких приміщень – ідеальний варіант 👍\n'
                '– в програмі використовуємо експерименти з фізики ⚙️, хімії 🧪 та вау-елемент – сухий лід ❄️\n'
                'Тривалість: 35 – 40 хв ⏰\n'
                'Для дітей: 4 – 10 років 👧🧒\n'
                'ВАРІАНТ 2. CRAZY КРІО ШОУ 🥶\n'
                '– в цій програмі професор розкаже дітям, що підкорити стихію холоду з температурою -196 градусів можна не лише у кіно 🎬, але і у реальному житті, і для цього є спеціальна формула 🧊\n'
                '– використовуємо експерименти з вітром 🌬️, вогнем 🔥, сухим льодом ❄️ та вау елемент – ефектні експерименти з рідким азотом 🧊\n'
                'Тривалість: 35 – 40 хв ⏰\n'
                'Для дітей: 6 -11 років 👦👧\n'
                'ВАРІАНТ 3. МЕГА НАУКОВЕ ШОУ (НАУКА + КРІО) 🤩\n'
                '– ця програма є максимально насиченою, адже тут все включено: фізика ⚙️, хімія 🧪, сухий лід ❄️ та кріо шоу 🧊\n'
                '– час проведення шоу орієнтовно 60+ хвилин ⏳\n'
                'Тривалість: 60 хв + ⏰\n'
                'Для дітей: 4 -11 років 👧🧒'
            ),
            'ШОУ МИЛЬНИХ БУЛЬБАШОК': 'Неймовірно чарівне та захоплююче доповнення до свята 🫧. Універсальний варіант, адже мильні бульбашки подобаються кожному: і малечі 👶, і дорослим 👨‍👩‍👧‍👦!',
            'ШОУ ФОКУСІВ': 'Шоу фокусів 🪄 – це сценічна інтерактивна програма, в якій діти приймають участь 🎩. Театрально поставлений номер, який звʼязує всю програму – робить її унікальною і цікавішою для глядачів 🤹‍♂️',
            'ПІННА ВЕЧІРКА': 'Пінна вечірка 🫧 створена для літа ☀️, або літо створено для неї! Веселощі гарантовані! 😁',
            'СКІТЛЗ ШОУ': (
                "SKITTLES SHOW 🌈\n"
                "За сюжетом шоу, діти відправляються на екскурсію до науково-фантастичного світу Веселки 🌈, де вони пройдуть цікавий шлях та мають розбудити Вулкан яскравого настрою Skittles! 🌋\n"
                "Дорога до нього лежить через 7 смуг Веселки, на кожній з яких діти будуть проходити яскраві наукові експерименти 🧪, знайомитися з жителями веселки 🧸, дивуватися незвичним фокусам 🪄 та навіть потраплять під дощ із цукерок 🍬.\n"
                "Що всередині: малюємо веселку за технікою спін-арт 🎨, дивимось на світ через спектральні окуляри 🕶️, надуваємо повітряну сосиску за 1 секунду 🌭, дивимося трюкові змагання пружинок Слінкі 🌀, розправимось з монстриком Хрюнделем 👾, спробуємо зробити чарівний торт 🎂, позапускаємо мильні хмаринки 🫧, зробимо різнокольоровий сніг ❄️, половимо дощ із цукерок 🍬 та ефектно розбудимо Вулкан гарного настрою Skittles з сюрпризом для іменинника 🎁.\n"
                "Тривалість: 35-40 хв ⏰\n"
                "Для дітей: 3-9 років 👦👧"
            )
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': '🧿 Маленькі чарівники створюють свій власний амулет з намистинок і любові ✨💖 — магія у власних руках! 🧙‍♂️',
            'Слайми - 1 дитина': '🧪 Веселе хімічне чаклунство: кожна дитина зробить свій кольоровий, тягучий слайм — мʼякий антистрес та море радості! 🎉',
            'Термомозаїка - 1 дитина': '🟡 Діти викладають яскраві фігурки з мозаїки, які перетворюються на справжні шедеври мистецтва 🎨✨',
            'Бомбочки для ванни - 1 дитина': '🛁 Ароматні, шипучі бомбочки ручної роботи — казковий релакс та кольорові хвилі у ванній! 💧🌈',
            'Шиммер коктейлі - 1 дитина': '🍹 Сяючі, магічні напої, які діти змішують самостійно — краса, блиск і смак в одному келиху! ✨🥤',
            'Шоколадний попіт - 1 дитина': '🍫 Популярний антистрес у смачному варіанті — дитина власноруч створює шоколадний попіт, щоб насолодитись солодким задоволенням! 😋',
            'Свічки - 1 дитина': '🕯️ Створення ароматної свічки з кольоровим декором — затишок, тепло і творчість у кожному вогнику! 🌈',
            'Мило - 1 дитина': '🧼 Веселий майстер-клас з виготовлення кольорового, запашного мила власного дизайну — чистота, аромат і задоволення! 🌸',
            'Пряники - 1 дитина': '🍪 Художній розпис смачних пряників — творчість, яку можна з’їсти! Яскраві фарби і солодкий смак! 🎨',
            'Окуляри - 1 дитина': '🕶 Створення стильного аксесуару на літо, який діти власноруч прикрасять та заберуть на згадку про свято 🔥',
            'Солодкі букети - 1 дитина': '💐 Яскраві квіти з цукерок — гарний і смачний подарунок, зроблений власноруч з любовʼю! 🍬',
            'Морозиво до 10 дітей': '🍦 Справжнє свято смаку з різними топінгами! Ванільне та шоколадне морозиво створене своїми руками — що може бути краще? 😍',
            'Морозиво до 20 дітей': '🍦 Справжнє свято смаку з різними топінгами! Ванільне та шоколадне морозиво створене своїми руками — що може бути краще? 😍',
            'Солодка вата до 10 дітей': '🍭 Повітряна, кольорова солодка хмаринка — мрія кожної дитини, смак якої дарує справжню радість! 🌈',
            'Солодка вата до 20 дітей': '🍭 Повітряна, кольорова солодка хмаринка — мрія кожної дитини, смак якої дарує справжню радість! 🌈',
            'Bubble tea до 10 дітей': '🍹 Яскравий напій з додаванням смачних кульок - це те, що покаже дітям спражній смак свята 🔥',
            'Bubble tea до 20 дітей': '🍹 Яскравий напій з додаванням смачних кульок - це те, що покаже дітям спражній смак свята 🔥',
        },'🎨 Декор': {
            'Базовий декор від': '🎀 Гармонійне оформлення з кульками, фотозоною та акцентами — стильне свято без зайвого клопоту! ✨',
            'Люкс декор від': '🌟 Вражаючий, індивідуальний декор, який підкреслить тематику свята та зробить фото неймовірними! 📸😍'
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від:': '🎉 Яскраве доповнення до свята: весела гра, що завершується дощем із солодощів! 🍬🌸',
            'Фігурна пін\'ята - від:': '🪅 Улюблені герої та кумедні форми — фігурна пін’ята здивує й порадує всіх дітей! 🌟😄'
        },
        '🎁 Експрес привітання': {
            '1 аніматор 20 хвилин': '🎈 Коротке, але яскраве привітання з улюбленим героєм — сюрприз, який точно здивує та подарує незабутні емоції! 🔥🥳',
            '2 аніматори 20 хвилин': '🎊 Коротке, але яскраве привітання з двома улюбленими героями — подвійний сюрприз і подвійна радість! 💥😁'
        }
    },
    'Кривий Ріг': {
        '🎭 Шоу': {
            'ШДМ шоу': '🎈 Шоу повітряних кульок — справжнє святкове диво, яке ви точно захочете побачити! 🤩✨',
            'Шоу пружини': '🌀 Унікальна Людина-Пружина — це саме той гість, який зробить ваше свято неповторним! 🎉',
            'Паперове шоу': '🪩 Паперове шоу — феєричний фінал будь-якого свята! Справжній водоспад блискучих стрічок і кольорових серпантинів створить яскраву атмосферу, даруючи круті емоції та веселощі! 🌈',
            'Шоу фокусів': '🪄 Шоу фокусів — це сценічна інтерактивна програма, в якій діти беруть участь. Театрально поставлений номер, який звʼязує всю програму, робить її унікальною й цікавою для глядачів! 🎩✨',
            'Шоу мильних бульбашок': '🫧 Неймовірно чарівне та захоплююче доповнення до свята. Мильні бульбашки подобаються кожному: і малечі, і дорослим! 😍',
            'Треш шоу': '💥 Наші крейзі професори Бум і Треш готові перевірити вас на сміливість і міцність, а також влаштувати справжній треш-бум! 🤯',
            'Хімічне шоу': '🧪 Готуйтесь зустрічати гостей з 9 планети! Космічні жителі здивують вас своїми неймовірними здібностями. 👽✨',
            'Тесла шоу': '⚡️ Це — унікальне шоу, яке покаже різноманітні, захоплюючі властивості електрики та точно здивує вас! Інтерактивні експерименти і видовищні ефекти заряджають на неймовірні враження! 💡',
            'Фабрика сюрпризів': '🎁 Знайомтесь! Смішко та Веселинка — вони найкраще з усіх знають, що таке СЮРПРИЗИ! 😄',
            'Пінна вечірка': '🫧 Пінна вечірка створена для літа, або літо створено для неї! Веселощі та сміх гарантовано! ☀️😁'
        },
        '🎨 Майстер-клас': {
            'Створення амулетів - 1 дитина': '🧿 Маленькі чарівники створюють свій власний амулет з намистинок і любові ✨💖 — магія у власних руках! 🧙‍♂️',
            'Солодкі букети - 1 дитина': '💐 Яскраві квіти з цукерок — гарний і смачний подарунок, зроблений власноруч з любовʼю! 🍬',
            'Слайми - 1 дитина': '🧪 Веселе хімічне чаклунство: кожна дитина зробить свій кольоровий, тягучий слайм — мʼякий антистрес та море радості! 🎉',
            'Термомозаїка - 1 дитина': '🟡 Діти викладають яскраві фігурки з мозаїки, які перетворюються на справжні шедеври мистецтва 🎨✨',
            'Бомбочки для ванни - 1 дитина': '🛁 Ароматні, шипучі бомбочки ручної роботи — казковий релакс та кольорові хвилі у ванній! 💧🌈',
            'Шиммер коктейлі - 1 дитина': '🍹 Сяючі, магічні напої, які діти змішують самостійно — краса, блиск і смак в одному келиху! ✨🥤',
            'Льодяники з ізомальту - 1 дитина': '🍭 Кожен гість зможе створити власний льодяник за унікальним та таємним рецептом, а також яскраво його прикрасити! 🌈',
            'Шоколадний попіт - 1 дитина': '🍫 Популярний антистрес у смачному варіанті — дитина власноруч створює шоколадний попіт, щоб насолодитись солодким задоволенням! 😋',
            'Свічки - 1 дитина': '🕯️ Створення ароматної свічки з кольоровим декором — затишок, тепло і творчість у кожному вогнику! 🌈',
            'Мило - 1 дитина': '🧼 Веселий майстер-клас з виготовлення кольорового, запашного мила власного дизайну — чистота, аромат і задоволення! 🌸',
            'Пряники - 1 дитина': '🍪 Художній розпис смачних пряників — творчість, яку можна з’їсти! Яскраві фарби і солодкий смак! 🎨',
            'Окуляри - 1 дитина': '🕶 Створення стильного аксесуару на літо, який діти власноруч прикрасять та заберуть на згадку про свято 🔥',
            'BEARBRICK - 1 дитина': '🐻 Створи власного унікального ведмедика за допомогою яскравих барв — твоя фантазія, твій стиль! 🎨',
            'Твістінг до 10 дітей': '🎈 Професійний майстер навчить кожного гостя робити будь-які фігурки з кольорових кульок — веселощі та творчість для всіх! 😃',
            'Твістінг до 20 дітей': '🎈 Професійний майстер навчить кожного гостя робити будь-які фігурки з кольорових кульок — ще більше радості для великої компанії! 🥳',
            'Морозиво до 10 дітей': '🍦 Справжнє свято смаку з різними топінгами! Ванільне та шоколадне морозиво створене своїми руками — що може бути краще? 😍',
            'Морозиво до 20 дітей': '🍦 Справжнє свято смаку з різними топінгами! Ванільне та шоколадне морозиво створене своїми руками — що може бути краще? 😍',
            'Солодка вата до 10 дітей': '🍭 Повітряна, кольорова солодка хмаринка — мрія кожної дитини, смак якої дарує справжню радість! 🌈',
            'Солодка вата до 20 дітей': '🍭 Повітряна, кольорова солодка хмаринка — мрія кожної дитини, смак якої дарує справжню радість! 🌈',
            'Bubble tea до 10 дітей': '🍹 Яскравий напій з додаванням смачних кульок - це те, що покаже дітям спражній смак свята 🔥',
            'Bubble tea до 20 дітей': '🍹 Яскравий напій з додаванням смачних кульок - це те, що покаже дітям спражній смак свята 🔥',
        },
        '🎨 Декор': {
            'Базовий декор від': '🎀 Гармонійне оформлення з кульками, фотозоною та акцентами — стильне свято без зайвого клопоту! ✨',
            'Люкс декор від': '🌟 Вражаючий, індивідуальний декор, який підкреслить тематику свята та зробить фото неймовірними! 📸😍'
        },
        "🎈 Пін'яти": {
            'Стандартна пін\'ята - від: ': '🎉 Яскраве доповнення до свята: весела гра, що завершується дощем із солодощів! 🍬🌸',
            'Велика пін\'ята - від: ': '🪅 Улюблені герої та кумедні форми — фігурна пін’ята здивує й порадує всіх дітей! 🌟😄'
        },
        '🎁 Експрес привітання': {
            '1 аніматор 20 хвилин': '🎈 Коротке, але яскраве привітання з улюбленим героєм — сюрприз, який точно здивує та подарує незабутні емоції! 🔥🥳',
            '2 аніматори 20 хвилин': '🎊 Коротке, але яскраве привітання з двома улюбленими героями — подвійний сюрприз і подвійна радість! 💥😁'
        }
    }
}

# Прості додаткові послуги (одна кнопка - одне додавання)
ADDITIONAL_SERVICES_SINGLE = {
    'Київ': {
        '💦 Аквагрим (до 10 дітей)': 1500,
        '💃 Глітер тату (до 10 дітей)': 2000,
        '🎂 Торти 1 кг': 1200,
        '📢 Колонка з мікрофоном від': 1000,
        '💡 ДИСКО СВІТЛО': 800,
        '🐻 Білий ведмедик (+дорога)': 2000,
        '🕺 Дзеркальні люди (двоє) 1 година': 2500,
        '🐦 Птахи (двоє) 1 година': 3500,
        '🎵 Діджей 1 г': 4000,
        '🎥 Відеограф 1 г': 3000,
        '📸 Фотограф 1 г': 2500,
        '🎤 Ведучий 1 г': 4000,
        '🫧 Генератор мильних бульбашок': 1000,

    },
    'Кривий Ріг': {
        '💦 Аквагрим (до 10 дітей)': 1000,
        '💃 Глітер тату (до 10 дітей)': 1000,
        '🎂 Торти 1 кг': 1000,
        '📢 Колонка з мікрофоном від': 800,
        '💡 ДИСКО СВІТЛО': 800,
        '🐻 Білий ведмедик (+дорога)': 1100,
        '🕺 Дзеркальні люди (двоє) 1 година': 1500,
        '🐦 Птахи (двоє) 1 година': 1500,
        '🫧 Генератор мильних бульбашок':800,
        '🎵 Діджей 1 г': 2000,
        '🎥 Відеограф 1 г': 2500,
        '📸 Фотограф 1 г': 1800,
        '🎤 Ведучий 1 г': 1500
    }
}

service_with_photo = [
    '🫧 Генератор мильних бульбашок', 
    '💦 Аквагрим (до 10 дітей)',
    '🐻 Білий ведмедик (+дорога)',
    '🕺 Дзеркальні люди (двоє) 1 година',
    '🐦 Птахи (двоє) 1 година',
    '💃 Глітер тату (до 10 дітей)',
    '🎂 Торти 1 кг',
    '💡 ДИСКО СВІТЛО'
    ]

# Вартість таксі для різних районів (туди/назад)
TAXI_PRICES = {
    'Київ': {
        'Деснянський район': 350,
        'Дніпровський район': 350,
        'Солом\'янський район': 600,
        'Шевченківський район': 600,
        'Голосіївський район': 450,
        'Печерський район': 500,
        'Подільський район': 600,
        'Святошинський район': 600,
        'Дарницький район': 400,
        'Оболонський район': 450,
        'Борщаговківський район': 600,
        'Інше': "По тарифу перевізника"  # Для інших районів
    },
    'Кривий Ріг': {
        'Довгинцівський район': 200,
        'Інгулецький район': 270,
        'Металургійний район': 150,
        'Покровський район': 270,
        'Саксаганський район': 220,
        'Тернівський район': 330,
        'Центрально-Міський район': 270,
        'Інше': "По тарифу перевізника"  # Для інших районів
    }
}

# Універсальне пояснення для майстер-класів
MASTER_CLASS_EXPLANATION = (
    " "
)












